{"meta":{"title":"Tsukie - Lifestyle, technologies, travel... and more","subtitle":null,"description":null,"author":"Tsukie Studio. All rights reserved.","url":"https://tsukie.com"},"pages":[{"title":"","date":"2019-05-15T15:42:15.129Z","updated":"2019-05-15T15:42:15.127Z","comments":true,"path":"404.html","permalink":"https://tsukie.com/404.html","excerpt":"","text":"The page you are looking for was not found. Back to homepage."},{"title":"","date":"2018-08-29T14:03:58.857Z","updated":"2018-08-29T14:03:58.857Z","comments":true,"path":"googlee1e3ed4981f080ed.html","permalink":"https://tsukie.com/googlee1e3ed4981f080ed.html","excerpt":"","text":"google-site-verification: googlee1e3ed4981f080ed.html"},{"title":"","date":"2019-04-10T13:26:58.060Z","updated":"2019-04-10T13:26:58.060Z","comments":true,"path":"contact-us.html","permalink":"https://tsukie.com/contact-us.html","excerpt":"","text":"What is Tsukie? \"Tsukie\" in Japanese means \"to the moon\". \"To the moon\" is a title of the RPG that tells a beautiful story about the adventure of two doctors trying to help the soon-to-be-deceased people have their last wish fulfilled in their dream. It is literally a \"game\", but actually a movie, with the plot gently developed, doesn't feel rushed, heart-touching, and has a satisfying ending. The game was one of our best experiences we have tried, and we decided to use the title of our most liked game as our website name! Our \"to the moon\", beside storytelling, will be where we'll share our thought, ideas, experiences, what we learned or what we think it would be useful... Currently, most of the articles are software programming oriented, self-help oriented, but in the future, we would like to expand the categories to other realms. This website will be inflated and become a mixed hotpot of experience ^^. We hope you will find our \"to the moon\" journey joyful and helpful! Who are we? We are software programmers couple who are learning to be a writer. Beside our full-time work as a programmer (we have experience with a plethora of technologies such as Java/PHP/Swift/MySQL/JS and its popular frameworks...), we enjoy reading and writing to try expressing our ideas and thought to the world. You can find our publications here or on our Medium channel: https://medium.com/@minhnh.da. Our writings are here and there, vying for your attention, so a comment or a like button press will greatly encourage us ^^ (The Facebook like button won't give us any info of who liked it, it only gives us a statistic of how many people have liked this article, so please feel free to like/share it!) If you have any inquiries, don't hesitate to mail me at minhnh.da@gmail.com!"},{"title":"","date":"2019-01-26T10:23:35.515Z","updated":"2019-01-26T10:23:35.515Z","comments":true,"path":"terms-and-conditions.html","permalink":"https://tsukie.com/terms-and-conditions.html","excerpt":"","text":"Welcome to Tsukie These terms and conditions outline the rules and regulations for the use of Tsukie's Website. Tsukie is located at:https://tsukie.com By accessing this website we assume you accept these terms and conditions in full. Do not continue to use Tsukie's website if you do not accept all of the terms and conditions stated on this page. The following terminology applies to these Terms and Conditions, Privacy Statement and Disclaimer Notice and any or all Agreements: “Client”, “You” and “Your” refers to you, the person accessing this website and accepting the Company’s terms and conditions. “The Company”, “Ourselves”, “We”, “Our” and “Us”, refers to our Company. “Party”, “Parties”, or “Us”, refers to both the Client and ourselves, or either the Client or ourselves. All terms refer to the offer, acceptance and consideration of payment necessary to undertake the process of our assistance to the Client in the most appropriate manner, whether by formal meetings of a fixed duration, or any other means, for the express purpose of meeting the Client’s needs in respect of provision of the Company’s stated services/products, in accordance with and subject to, prevailing law of . Any use of the above terminology or other words in the singular, plural, capitalisation and/or he/she or they, are taken as interchangeable and therefore as referring to same.License Unless otherwise stated, Tsukie and/or it’s licensors own the intellectual property rights for all material on Tsukie. All intellectual property rights are reserved. You may view and/or print pages from https://tsukie.com for your own personal use subject to restrictions set in these terms and conditions. You must not: Republish material from https://tsukie.com Sell, rent or sub-license material from https://tsukie.com Reproduce, duplicate or copy material from https://tsukie.com Redistribute content from Tsukie (unless content is specifically made for redistribution). User Comments This Agreement shall begin on the date hereof. Certain parts of this website offer the opportunity for users to post and exchange opinions, information, material and data ('Comments') in areas of the website. Tsukie does not screen, edit, publish or review Comments prior to their appearance on the website and Comments do not reflect the views or opinions ofTsukie, its agents or affiliates. Comments reflect the view and opinion of the person who posts such view or opinion. To the extent permitted by applicable laws Tsukieshall not be responsible or liable for the Comments or for any loss cost, liability, damages or expenses caused and or suffered as a result of any use of and/or posting of and/or appearance of the Comments on this website. Tsukiereserves the right to monitor all Comments and to remove any Comments which it considers in its absolute discretion to be inappropriate, offensive or otherwise in breach of these Terms and Conditions. You warrant and represent that: You are entitled to post the Comments on our website and have all necessary licenses and consents to do so; The Comments do not infringe any intellectual property right, including without limitation copyright, patent or trademark, or other proprietary right of any third party; The Comments do not contain any defamatory, libelous, offensive, indecent or otherwise unlawful material or material which is an invasion of privacy The Comments will not be used to solicit or promote business or custom or present commercial activities or unlawful activity. You hereby grant to Tsukie a non-exclusive royalty-free license to use, reproduce, edit and authorize others to use, reproduce and edit any of your Comments in any and all forms, formats or media. Hyperlinking to our Content The following organizations may link to our Web site without prior written approval: Government agencies; Search engines; News organizations; Online directory distributors when they list us in the directory may link to our Web site in the same manner as they hyperlink to the Web sites of other listed businesses; and Systemwide Accredited Businesses except soliciting non-profit organizations, charity shopping malls, and charity fundraising groups which may not hyperlink to our Web site. These organizations may link to our home page, to publications or to other Web site information so long as the link: (a) is not in any way misleading; (b) does not falsely imply sponsorship, endorsement or approval of the linking party and its products or services; and (c) fits within the context of the linking party's site. We may consider and approve in our sole discretion other link requests from the following types of organizations: commonly-known consumer and/or business information sources such as Chambers of Commerce, American Automobile Association, AARP and Consumers Union; dot.com community sites; associations or other groups representing charities, including charity giving sites, online directory distributors; internet portals; accounting, law and consulting firms whose primary clients are businesses; and educational institutions and trade associations. We will approve link requests from these organizations if we determine that: (a) the link would not reflect unfavorably on us or our accredited businesses (for example, trade associations or other organizations representing inherently suspect types of business, such as work-at-home opportunities, shall not be allowed to link); (b)the organization does not have an unsatisfactory record with us; (c) the benefit to us from the visibility associated with the hyperlink outweighs the absence of ; and (d) where the link is in the context of general resource information or is otherwise consistent with editorial content in a newsletter or similar product furthering the mission of the organization. These organizations may link to our home page, to publications or to other Web site information so long as the link: (a) is not in any way misleading; (b) does not falsely imply sponsorship, endorsement or approval of the linking party and it products or services; and (c) fits within the context of the linking party's site. If you are among the organizations listed in paragraph 2 above and are interested in linking to our website, you must notify us by sending an e-mail to minhnh.da@gmail.com. Please include your name, your organization name, contact information (such as a phone number and/or e-mail address) as well as the URL of your site, a list of any URLs from which you intend to link to our Web site, and a list of the URL(s) on our site to which you would like to link. Allow 2-3 weeks for a response. Approved organizations may hyperlink to our Web site as follows: By use of our corporate name; or By use of the uniform resource locator (Web address) being linked to; or By use of any other description of our Web site or material being linked to that makes sense within the context and format of content on the linking party's site. No use of Tsukie’s logo or other artwork will be allowed for linking absent a trademark license agreement. Iframes Without prior approval and express written permission, you may not create frames around our Web pages or use other techniques that alter in any way the visual presentation or appearance of our Web site. Reservation of Rights We reserve the right at any time and in its sole discretion to request that you remove all links or any particular link to our Web site. You agree to immediately remove all links to our Web site upon such request. We also reserve the right to amend these terms and conditions and its linking policy at any time. By continuing to link to our Web site, you agree to be bound to and abide by these linking terms and conditions. Removal of links from our website If you find any link on our Web site or any linked web site objectionable for any reason, you may contact us about this. We will consider requests to remove links but will have no obligation to do so or to respond directly to you. Whilst we endeavour to ensure that the information on this website is correct, we do not warrant its completeness or accuracy; nor do we commit to ensuring that the website remains available or that the material on the website is kept up to date. Content Liability We shall have no responsibility or liability for any content appearing on your Web site. You agree to indemnify and defend us against all claims arising out of or based upon your Website. No link(s) may appear on any page on your Web site or within any context containing content or materials that may be interpreted as libelous, obscene or criminal, or which infringes, otherwise violates, or advocates the infringement or other violation of, any third party rights. Disclaimer To the maximum extent permitted by applicable law, we exclude all representations, warranties and conditions relating to our website and the use of this website (including, without limitation, any warranties implied by law in respect of satisfactory quality, fitness for purpose and/or the use of reasonable care and skill). Nothing in this disclaimer will: limit or exclude our or your liability for death or personal injury resulting from negligence; limit or exclude our or your liability for fraud or fraudulent misrepresentation; limit any of our or your liabilities in any way that is not permitted under applicable law; or exclude any of our or your liabilities that may not be excluded under applicable law. The limitations and exclusions of liability set out in this Section and elsewhere in this disclaimer: (a) are subject to the preceding paragraph; and (b) govern all liabilities arising under the disclaimer or in relation to the subject matter of this disclaimer, including liabilities arising in contract, in tort (including negligence) and for breach of statutory duty. To the extent that the website and the information and services on the website are provided free of charge, we will not be liable for any loss or damage of any nature."},{"title":"","date":"2019-01-26T10:23:35.514Z","updated":"2019-01-26T10:23:35.514Z","comments":true,"path":"privacy-policy.html","permalink":"https://tsukie.com/privacy-policy.html","excerpt":"","text":"Welcome to our Privacy Policy Your privacy is critically important to us. Tsukie is located at:https://tsukie.com It is Tsukie’s policy to respect your privacy regarding any information we may collect while operating our website. This Privacy Policy applies to https://tsukie.com (hereinafter, \"us\", \"we\", or \"https://tsukie.com\"). We respect your privacy and are committed to protecting personally identifiable information you may provide us through the Website. We have adopted this privacy policy (\"Privacy Policy\") to explain what information may be collected on our Website, how we use this information, and under what circumstances we may disclose the information to third parties. This Privacy Policy applies only to information we collect through the Website and does not apply to our collection of information from other sources. This Privacy Policy, together with the Terms and conditions posted on our Website, set forth the general rules and policies governing your use of our Website. Depending on your activities when visiting our Website, you may be required to agree to additional terms and conditions. Website Visitors Like most website operators, Tsukie collects non-personally-identifying information of the sort that web browsers and servers typically make available, such as the browser type, language preference, referring site, and the date and time of each visitor request. Tsukie’s purpose in collecting non-personally identifying information is to better understand how Tsukie’s visitors use its website. From time to time, Tsukie may release non-personally-identifying information in the aggregate, e.g., by publishing a report on trends in the usage of its website. Tsukie also collects potentially personally-identifying information like Internet Protocol (IP) addresses for logged in users and for users leaving comments on https://tsukie.com blog posts. Tsukie only discloses logged in user and commenter IP addresses under the same circumstances that it uses and discloses personally-identifying information as described below. Advertisements Ads appearing on our website may be delivered to users by advertising partners, who may set cookies. These cookies allow the ad server to recognize your computer each time they send you an online advertisement to compile information about you or others who use your computer. This information allows ad networks to, among other things, deliver targeted advertisements that they believe will be of most interest to you. This Privacy Policy covers the use of cookies by Tsukie and does not cover the use of cookies by any advertisers. Links To External Sites Our Service may contain links to external sites that are not operated by us. If you click on a third party link, you will be directed to that third party's site. We strongly advise you to review the Privacy Policy and terms and conditions of every site you visit. We have no control over, and assume no responsibility for the content, privacy policies or practices of any third party sites, products or services. Https://tsukie.com uses Google AdWords for remarketing Https://tsukie.com uses the remarketing services to advertise on third party websites (including Google) to previous visitors to our site. It could mean that we advertise to previous visitors who haven’t completed a task on our site, for example using the contact form to make an enquiry. This could be in the form of an advertisement on the Google search results page, or a site in the Google Display Network. Third-party vendors, including Google, use cookies to serve ads based on someone’s past visits. Of course, any data collected will be used in accordance with our own privacy policy and Google’s privacy policy. You can set preferences for how Google advertises to you using the Google Ad Preferences page, and if you want to you can opt out of interest-based advertising entirely by cookie settings or permanently using a browser plugin. Aggregated Statistics Tsukie may collect statistics about the behavior of visitors to its website. Tsukie may display this information publicly or provide it to others. However, Tsukie does not disclose your personally-identifying information. Affiliate Disclosure This site uses affiliate links and does earn a commission from certain links. This does not affect your purchases or the price you may pay. Analytics We may use third-party Service Providers to monitor and analyze the use of our Service. Google Analytics Google Analytics is a web analytics service offered by Google that tracks and reports website traffic. Google uses the data collected to track and monitor the use of our Service. This data is shared with other Google services. Google may use the collected data to contextualize and personalize the ads of its own advertising network. You can opt-out of having made your activity on the Service available to Google Analytics by installing the Google Analytics opt-out browser add-on. The add-on prevents the Google Analytics JavaScript (ga.js, analytics.js, and dc.js) from sharing information with Google Analytics about visits activity. For more information on the privacy practices of Google, please visit the Google Privacy & Terms web page: https://policies.google.com/privacy?hl=en Privacy Policy Changes Although most changes are likely to be minor, Tsukie may change its Privacy Policy from time to time, and in Tsukie’s sole discretion. Tsukie encourages visitors to frequently check this page for any changes to its Privacy Policy. Your continued use of this site after any change in this Privacy Policy will constitute your acceptance of such change."}],"posts":[{"title":"Make money online with no experience story: My first dollars on the Internet","slug":"make-money-online-with-no-experience-story-my-first-dollars-on-the-internet","date":"2019-05-23T15:47:41.000Z","updated":"2019-05-23T17:37:52.460Z","comments":true,"path":"en/lifestyle/make-money-online-with-no-experience-story-my-first-dollars-on-the-internet/","link":"","permalink":"https://tsukie.com/en/lifestyle/make-money-online-with-no-experience-story-my-first-dollars-on-the-internet/","excerpt":"","text":"Article available in English Besides my full-time job, I also looked for various ways to turn my leisure time to something that was at least productive and fruitful to me. Though most of it became chilling time in front of anime or game or youtube shows, I have tried. Until now I still can’t make a living out of what I have tried, but at least I believe that I found the most suitable way for me to turn my free time to pennies, and I have fun doing it. Through my story, I hope that I can inspire you to forge your path of making money online. You might not make a lump sum out of it, but you will find the joy to discover that, the internet can give you more than just Facebook news feed or Netflix. 1. Online stockThe millionaire next door was the first book that changed my attitude towards making money, and Rich dad poor dad and The richest man in Babylon were the two books that ignited my determination to jump into the chaos of online stock market. I created an online account, buy the recommended stock education book on Amazon (I even turned all my learning into an article and posted it on Medium…)Having faith in my knowledge, I entered the battle with other professionals and the result was something you could easily anticipate. I failed miserably. My knowledge was right, the book about stocks was not wrong, and I believed I had done all the right things I can to analyze the finance report. And yet, I didn’t know that the stock market was a crazy entity, and the stock battlefield was much crueler than I expected. I was deluded that I could beat other well-equipped professionals and convert all of their loss to my profit. Fortunately, it was not too late for me to realize that handpicking stocks is a loser’s game. I stopped buying individual stocks and followed one investing strategy posted on Lifehacker. No need to spend time on researching companies’ financial situation, or subscribe to financial latest news anymore. This “set and forget” investment strategy is such a peace of mind! 2. Blogging on my websiteI found the best investment strategy that suited me and helped me step on the first block of building wealth. However, long-term investment isn’t going to bring cash quickly soon, so I have to find other ways to earn pennies within a shorter timeframe. After considering various methods of making money online, I decided to run a personal blog. I chose it because: ⁃ Minimal starting up cost. A domain fee per year costs less than 2 cups of Starbucks, and with a static site I don’t even have to pay for hosting fee. ⁃ I can program a website, do all the technical things myself. A well-coded blog can be used as a skillset showcase and prettify my CV. ⁃ I can write articles, and I believe I can turn what I know and my experience into words. English is not my first language, but I can write in English without relying too much on Google translate. ⁃ More than that, I love the idea of having my own place on the Internet!And in 2018 January, my blog debuted on the internet!But making money with blog is a long journey, and I didn’t write often. A year passed and my blog hadn’t attracted any visitors on the internet.I kept writing anyway. I tried to craft every writing carefully, and I always asked myself “Would this article bring any value to me if I were a reader”.And on a sunny day, one of my post eventually got attention from the search engines, I started to see search engine traffics going to my blog.When daily arriving users reached 50, I tried putting some AdSense ads in my blog.I was very excited when I saw the first pennies appeared in my Adsense dashboard!A modest amount of traffic (~70 users per day) brought 2$ a month to me!That was when I saw the potential of blogging. 2$ isn’t even enough to eat out, but a voice already sparked in my mind. I can freaking do this. I can get money from the internet just by typing words! 3. Medium blog platformI saw traffic coming to my blog, but disappointingly, bounce rate is still high. People only come to see the tutorial, they don’t engage further. My other posts about self-help, thoughts, personal experience… virtually got zero views. Because my blog is nowhere near being well-known, the only traffic I expect to see is through search engines.I looked for other ways to reach new audiences, and I came across Medium. Because Medium suggests a variety of categories to readers, my other posts will have a chance to be given a read. People on Medium are reading articles of multiple categories, not just looking for “how to reset Jetbrains product trial” 😂.And without a second thought, I published all of my blog content on Medium.In the beginning, the result wasn’t optimistic either. No one noticed my posts for months.I kept writing anyway. I tried to craft every writing carefully, and I always asked myself “Would this article bring any value to me if I were a reader”.I published my writings on both my personal blog and my Medium account.Gradually, a few wanderers came reading my posts, and I didn’t know since when two of my posts were distributed by “curators” 😂I thank you all for empathizing with my thinking! I’m not an expert in financial or psychological field, but I’m glad that someone found my writing helpful and wanted to share them!My writings generated only a little amount of allowance, but I’m very grateful to you for your support!These little encouragements truly motivated me to keep writing and publishing! Knowing my writings are somehow helpful to others is the best feeling I’ve ever had since I started blogging!I realized: If we are honest about building something that will become helpful to people, that’s also equal to helping ourselves. Give to life first then life will reward you two-fold, creating a win-win relationship. 4. Conclusion“Make money online” is not an alien word in 2019, and everyone has their method of benefiting from the internet. For me, it is very cool to build an online blog as “my own home on the internet”, with each article as a brick, progressively forming themselves into a house. I know blogging is not a get-rich-quick scheme, it certainly tests my patience and needs a lot of care before it can bear fruit. But I also learned that being myself and keep writing with all my sincere heart, together with resilience, constant commitment and time will eventually find me an audience that shares their mutual inner voices with me. We will bring value to each other and advance together. SEO or promoting is also vital, but what matters the most is what a blog primarily delivers: Words! Even if you have no experience in making money online with blogging, put all your heart and soul in crafting your best contents, and gather experience on the way of learning, that should be the initial momentum to carry you to success.English isn’t my first language, I don’t have TOEIC or IELTS certificates, and my major wasn’t literature or journalism, and I can still get a few dollars from blogging. You guys will DEFINITELY DO BETTER!","categories":[{"name":"lifestyle","slug":"lifestyle","permalink":"https://tsukie.com/categories/lifestyle/"}],"tags":[{"name":"website","slug":"website","permalink":"https://tsukie.com/tags/website/"},{"name":"self-help","slug":"self-help","permalink":"https://tsukie.com/tags/self-help/"},{"name":"blogging","slug":"blogging","permalink":"https://tsukie.com/tags/blogging/"},{"name":"make-money-online","slug":"make-money-online","permalink":"https://tsukie.com/tags/make-money-online/"}]},{"title":"SEO prioritize keyword research or content writing? Insights from my observations and results","slug":"seo-prioritize-keyword-research-or-content-writing-insights-from-my-observations-and-results","date":"2019-05-15T15:38:16.000Z","updated":"2019-05-23T17:12:46.479Z","comments":true,"path":"en/technologies/seo-prioritize-keyword-research-or-content-writing-insights-from-my-observations-and-results/","link":"","permalink":"https://tsukie.com/en/technologies/seo-prioritize-keyword-research-or-content-writing-insights-from-my-observations-and-results/","excerpt":"","text":"Article available in English Google Keyword Planner is a close friend of everybody who competes for the position in #1 page on Google search. However, stuffing your website with keywords won’t get you to the #1 page, and Google might flag your site as trying to circumvent its searching algorithm. In my case, I’ve written blog posts for a year without researching keywords. Yet, one of my post emerged into #1 page of Google search, sometimes with a completely unrelated search phrase. Let’s see how the post is displayed with different keyword searches. My 2 chosen keywords are “Jetbrains” and “reset trial”. This blog post was on the internet for quite a while (8-9 months or so), therefore it was undoubtedly indexed by Google.And I had to conclude that Google disregarded my arranged keywords. As what you have seen in these screenshots, unrelated searched keyword delivered my blog post to page 1, while with the search phrase that matched my chosen keyword, my blog post was nowhere to be seen. Actually, there weren’t too many organic search traffic coming to my blog until recently, when the blog post above started hitting the search result and became the primary landing page and I started looking at what drove my post to page #1.Even now, there are not so many pages or posts that contain “jetbrains reset trial” phrase and yet, my blog post was buried deep down on the internet for a long time. So, the point is keyword research is not as effective as you might think. Don’t get me wrong - it is essential to SEO, but if you only do keyword research and don’t polish your post with good content, then it will be ignored gradually by the search engines. Google’s ranking algorithm is, when people search for something and find your website, if they navigate back shortly after visiting your website and look for the next result, Google will decrease your website ranking for that search result. Trying to cheat the search engines won’t last you long. The worst thing is, your website might be flagged as spam and may even be removed from Google index. To avoid that, instead of trying to play around the algorithm, devote your effort to creating helpful content. Eventually, Google will recognize your website and grant it an appropriate ranking. And paying attention to technical SEO helps a lot too. Since this is much more measurable than keyword SEO and not quite hard to follow while providing visible results, you should consider doing it as thoroughly as you can. Use technical SEO audit tools like https://www.woorank.com/ to probe for potential technical flaws. Install SSL, get your website an AMP version, optimize resources, improve mobile-friendliness… will make your website look better and easy to analyze for Google search, thus resulting in better ranking. Pushing your website to search engines’ page #1 is vital for your business, but providing real value to your users is a cornerstone to build up your stable, everlasting business. Blogging and content writing usually takes a very, very much time to be nurtured before they can bear fruit. Be patient, resilient, keep researching and applying what you have learned, and one day you will reap your deserved rewards.","categories":[{"name":"technologies","slug":"technologies","permalink":"https://tsukie.com/categories/technologies/"}],"tags":[{"name":"website","slug":"website","permalink":"https://tsukie.com/tags/website/"},{"name":"blogging","slug":"blogging","permalink":"https://tsukie.com/tags/blogging/"}]},{"title":"iOS 12 uncover jailbreak random respring - Cause and solution suggestion","slug":"uncover-jailbreak-ios-12-random-respring-cause-and-solution-suggestion","date":"2019-05-04T08:58:24.000Z","updated":"2019-05-17T14:50:41.836Z","comments":true,"path":"en/technologies/uncover-jailbreak-ios-12-random-respring-cause-and-solution-suggestion/","link":"","permalink":"https://tsukie.com/en/technologies/uncover-jailbreak-ios-12-random-respring-cause-and-solution-suggestion/","excerpt":"","text":"Article available in English Many Reddit users have reported the random respring bug on their iOS 12 devices jailbroken by unc0ver. Some users posted their devices’ crash logs, and the cause of random respring was assumed that the occupied memory was overflowed and caused the springboard to crash, leading to respring. My iPhone 6S device respringed itself at least twice a day. Based on that theory, I have tried to find a solution to stop the random resprings on my device. For me, after many tries, the MiDevice tweak seemed to be the cause since it could change the springboard icon’s opacity and layout and make folder icon background as well as opened folder background become transparent. By disabling MiDevice tweak via iCleaner and using Boxy 3 instead, the random respring frequency apparently dropped significantly (Once per 2 days). Snowboard tweak was also reported as the random respring culprit, but under my observation, it was unlikely that Snowboard tweak was the cause (I uninstalled Snowboard, and the random respring bug still continued). But the ultimate solution was not that By turning on “Increase Memory Limit” and re-jailbreaking, my device hasn’t had any random resprings in the last 2 days with MiDevice installed! Perhaps the insufficient memory cause that led to respring theory was right after all. I also didn’t use the status bar editing feature in MiDevice. There was an incompatible status bar modifier that caused my device to fall into safe mode before, and for extra safety, I refrained from using that feature. Conclusion: Random respring solution I have collected so farI will sort the solution list by its relevance and importance. (adsbygoogle = window.adsbygoogle || []).push({}); Enable the “Increase Memory Limit” option in unc0ver, and re-jailbreak. You might want to disable status bar editing tweaks or features temporarily. That might include many status bar modifiers such as Zeppelin, Alkaline… Disable them and observe for a few days to see whether the random respring frequency is reduced. For me, enabling the status bar modifier function in MiDevice caused the device to random respring at least twice per day. I turned it off and the device has run without fail for 3 days! Uninstall all pirate tweaks and remove all pirate repositories in your device. Use Snapback tweak to back up your installed tweaks, and then enable “Restore RootFS” function in unc0ver and re-jailbreak to return your device to newly jailbroken state. Then restore your installed tweaks via Snapback. Try switching to Chimera jailbreak. Chimera comes with Sileo (a Cydia alternative), it has its own tweak installing mechanism which is different from Cydia substrate. Since Cydia substrate hasn’t been updated to support iOS 12 fully, it might be unstable and this might be the cause of random resprings. I tried switching to Chimera/Sileo and had not experienced any random resprings during that time. The reason I turned back to unc0ver is that Sileo tweak injecting mechanism doesn’t work well with some tweaks, for example, Youtube Tools or Safari Plus (I would like to cover the differences, as well as my personal experience between unc0ver and Chimera in a later article). If the tweaks you are using are compatible with Chimera/Sileo then you might want to permanently migrate to Chimera jailbreak (Use Snapback to backup your tweaks just in case you want to switch back to unc0ver). BonusShow off your home screen personalization. Here is mine!","categories":[{"name":"technologies","slug":"technologies","permalink":"https://tsukie.com/categories/technologies/"}],"tags":[{"name":"ios","slug":"ios","permalink":"https://tsukie.com/tags/ios/"},{"name":"hack","slug":"hack","permalink":"https://tsukie.com/tags/hack/"},{"name":"jailbreak","slug":"jailbreak","permalink":"https://tsukie.com/tags/jailbreak/"}]},{"title":"Adding non-PHP libraries to a Laravel project using Composer","slug":"adding-non-php-libraries-to-a-laravel-project-with-composer","date":"2019-04-09T02:33:54.000Z","updated":"2019-04-09T14:13:04.468Z","comments":true,"path":"en/technologies/adding-non-php-libraries-to-a-laravel-project-with-composer/","link":"","permalink":"https://tsukie.com/en/technologies/adding-non-php-libraries-to-a-laravel-project-with-composer/","excerpt":"","text":"Article available in English Adding a Javascript library to your project might require Javascript-related tools, like NodeJS, npm, Webpack… But if your project happens to be using Laravel as web development framework, you can simply use Composer and Laravel built-in functions to add your new Javascript libraries, or libraries of any languages, to your existing project! Let’s figure out how we can do that. 1. Add your library to your composer.jsonFirst, check if your library is available on packagist.org. If it isn’t, we will make it available!In this article, I will use this pure-JS library https://github.com/scratchy/jquery-jsonview as an example, and I’m going to add it to my existing project. Fortunately, this library is already available on packagist.org: https://packagist.org/packages/scratchy/jquery-jsonview . What we only have to do is using composer require scratchy/jquery-jsonview command or manually specifying it in our composer.json to prepare for composer update. If your library is not available on packagist yet, create a composer.json file inside your library, and publish your library to packagist. Since publishing libraries to packagist won’t be covered in this article, please refer to https://packagist.org/ for procedures to upload a library. 2. Run composer update after specifying new libraries in your composer.jsonYour newly added libraries will be available at vendor folder. 3. Create a ServiceProviderThe ServiceProvider class is responsible for copying the libraries to the location where your application can use it. If you are adding a CSS/JS library to your project, the destination is likely to be under public folder. Let’s use artisan to create the responsible ServiceProvider. For this article’s example, it would be:1php artisan make:provider JsonViewServiceProvider In the boot() method inside app/Provider/JsonViewServiceProvider.php, add the following code:1$this-&gt;publishes([__DIR__ . '/../../vendor/scratchy/jquery-jsonview' =&gt; public_path() . '/vendor/jquery-jsonview'], 'debug'); (That /../../ is needed because ServiceProvider class, which will copy folders when artisan vendor:publish command is executed, is lying under app/Provider/, so you have to point it to appropriate direction like you are navigating inside a terminal).The code above will copy vendor/scratchy/jquery-jsonview folder (which was installed by composer update) to public/vendor/ folder when executing php artisan vendor:publish --tag=debug command. If you would like Laravel to copy the library to different location under public folder, simply change /vendor/jquery-jsonview to an according path. 4. Specify your created ServiceProvider in config/app.phpThis is necessary for artisan to recognize your newly created ServiceProvider. Inside provider section of config/app.php, specify your ServiceProvider like this:123456789return [ // Other configs above 'providers' =&gt; [ // Other providers 'App\\Providers\\JsonViewServiceProvider', // Other providers ], // Other configs below]; 5. Run artisan vendor:publish commandAt the root of your Laravel project, execute this command:1php artisan vendor:publish --tag=debug The output should be like this:12Copied Directory [/vendor/scratchy/jquery-jsonview] To [/public/vendor/jquery-jsonview]Publishing complete for tag [debug]! 6. Verify if your newly added libraries appear under your targeted location!Congratulation, you have successfully added your non-PHP library to your Laravel project without dealing with npm nodejs gulp webpack stuff!","categories":[{"name":"technologies","slug":"technologies","permalink":"https://tsukie.com/categories/technologies/"}],"tags":[{"name":"programming","slug":"programming","permalink":"https://tsukie.com/tags/programming/"},{"name":"software-development","slug":"software-development","permalink":"https://tsukie.com/tags/software-development/"},{"name":"php","slug":"php","permalink":"https://tsukie.com/tags/php/"},{"name":"laravel","slug":"laravel","permalink":"https://tsukie.com/tags/laravel/"}]},{"title":"What is humblebragging, why is it obnoxious, and how to avoid it","slug":"what-is-humblebragging-why-it-is-obnoxious-and-how-to-avoid-it","date":"2019-02-15T06:57:44.000Z","updated":"2019-04-09T14:13:04.474Z","comments":true,"path":"en/lifestyle/what-is-humblebragging-why-it-is-obnoxious-and-how-to-avoid-it/","link":"","permalink":"https://tsukie.com/en/lifestyle/what-is-humblebragging-why-it-is-obnoxious-and-how-to-avoid-it/","excerpt":"","text":"Article available in English “Humble brag” is a new definition that was recognized after the creation of social media. The amount of social media posts that classified as “humble bragging” category increases so quickly that people have become aware of it nowadays. Humblebrag is perceived obnoxious, offensive and may damage your reputation as well as your social relationship. In this article, you will get to see what will be looked as “humblebragging”, why it causes troubles and how to not fall into the trap of humblebragging. 1. What is “humblebragging”?The word implies “humbly” + “brag”, which has the same expression as “indirect boast”, “disguised brag”. When you express something about you or your achievement humbly, or you complain about it, but actually, it is what the masses are craving, you are “humblebragging”. You may do it unconsciously or deliberately. Let’s look at these two “humblebragging” examples: (These examples are solely fictional and not related to any individuals.) These two are boasts, couched in humble statements. If you rewrite these two posts straightforwardly, they would be respectively “Look at it! I earned 2000$ from my side gigs!” and “Look at it! I got two scholarship offers from Harvard and MIT!”. Do you get an image of what kind of expression humblebragging is? So, the next mystery is… 2. …why people humblebrag?Let’s admit: I also have humblebragged a couple of times. I will try to speculate why people humblebrag based on my thought and point of view, and what I know about humblebragging. They want to brag, at the same time they don’t want to be perceived as full of themselves. The usual approach to elicit admiration is using innocuous, humble statement or disingenuous complaint as a method to deliver the real message, which conversely, put them in the spotlight of attention. By making light of their achievement (coating it with complaint or humility) they attempt to emphasize it in a circuitous but impressive fashion. Using complaint or humility to indirectly make people recognize their achievement will make them feel good, much more than outright bragging. When a person with more success joins the show, they can easily shrug it off “I didn’t brag about it, I was humble enough, I’m complaining about it…”. This kind of thought is often found in insecure people, and by “humblebragging”, they establish their defensive mechanism against potential spotlight competitors. 3. Why is humblebragging obnoxious?Bragging won’t make friends as it is deemed arrogant, but humblebragging can even be perceived as insincerity. Some people have spent years for achieving something that is being made light of, and it is what bothers them indeed. Moreover, between the two types of humblebragging: Humility-based and complaint-based, people seem to resent the latter more than the former. In their point of view, complaint-based humblebrag is a kind of direct insult that stabs right at their vanity. People inevitably fall into the comparison trap when they see a bragging post, and with humblebragging, the insincerity that people sense in the complaint or humility makes them feel belittled. That is why people perceive humblebragging as more despicable than outright bragging. The fact is, humblebragging won’t elicit any liking or sympathy, it only arouses resentment and contempt. 4. How to avoid being perceived as “humblebragger”?Whatever the content you post on social media is your absolute right to decide, no one can interfere. However, humblebragging can bring more harm than good, the fleeting gratification your post yields may not worth the damage it causes to your social relationship, which might be already on the verge of collapse. You may humblebrag deliberately or involuntarily, but either way, the effect of humblebragging is the same. Therefore, to not push yourself to an unfavorable position, you had better brag overtly or not brag at all. Some people still hate braggarts, but at least you won’t be perceived as insincere or deceitful.Also, as a straightforward brag, you should brag with judiciousness. If there are people who are close to you striving for years for what you are going to brag, you should pay some attention and set the post’s privacy so that they won’t see it. Choose the words carefully so that you don’t seem arrogant and the post won’t induce resentment and hatefulness. If you are unsure of whether you should brag or not, then don’t brag at all. Share your success with people whom you know will positively respond to you with hearty supports. ConclusionSocial media can bring people closer together, or enlarge the already existing void between people. How you interact with social media can enhance or destroy your relationship. Being aware of when you are going to “humblebrag” will save you from envy and hatred, and being selective in what you post on social media will help you avoid bad circumstances and enjoy your online life better.","categories":[{"name":"lifestyle","slug":"lifestyle","permalink":"https://tsukie.com/categories/lifestyle/"}],"tags":[{"name":"experience","slug":"experience","permalink":"https://tsukie.com/tags/experience/"},{"name":"two-cents","slug":"two-cents","permalink":"https://tsukie.com/tags/two-cents/"},{"name":"self-help","slug":"self-help","permalink":"https://tsukie.com/tags/self-help/"},{"name":"mental","slug":"mental","permalink":"https://tsukie.com/tags/mental/"}]},{"title":"If you ever feel like a loser, here are 6 tips that can help you feel better","slug":"if-you-ever-feel-like-a-loser-tips-that-help-you-feel-better","date":"2019-02-14T02:52:24.000Z","updated":"2019-04-09T14:13:04.471Z","comments":true,"path":"en/lifestyle/if-you-ever-feel-like-a-loser-tips-that-help-you-feel-better/","link":"","permalink":"https://tsukie.com/en/lifestyle/if-you-ever-feel-like-a-loser-tips-that-help-you-feel-better/","excerpt":"","text":"Article available in English Before trying anything else, recovering from a negative mood state should be granted the highest priority. What help you pull yourself together can vary, but these tips below are asserted as the most effective by many self-help writers. 1. Unfollow social media completely. Looking at peers who are more successful than you will severely depress youThe first and foremost thing you must do is quit browsing social media, at once.Why?Did you ever get a bad mark because of a silly mistake and see your friends being happy with their perfect score? Does your job suck, and you look at your acquaintances keep getting promoted or switching to a position with a handsome monthly wage? Or you are forced to leave the country you have stayed for long while looking at your peers posting amazing moments in that promised land on social media?How did you feel at those times? Deep ** yeah I know, I admit I have been feeling like that countless times. Can you distinct when you admire a person and when you envy a person?You admire a person when he/she achieves something that you understand you might not be able to replicate even with enormous effort. You envy a person when he/she achieves something that you know you are able to do but you didn’t do it for some reasons or something that you no longer have or you can no longer reach. The envy is responsible for making you feel like a loser, ultimately.Seeing your peers enjoy things that you can’t do, having things that you don’t have is like a sharp claw tearing your self-esteem apart. Merely seeing is the source which dejects you. Cutting the source, which means disconnecting from social media entirely, is the only way to help you feel better. You cannot be reminded of something disheartening if you don’t get to see it. Be a social media hermit, and you will gradually recover your mentality, guaranteed. But, you might recover faster if you… 2. …open your heart to those who care about you sincerelySo, who are they?Whom do you think will be genuinely happy to see you succeed in your life? Whom are you genuinely happy to see them succeed in their life?Those are the ones you should open your heart to.You don’t need to tell them how low you’re feeling or what ** you’re dealing with, just spend quality time with them, gossip about nonsenses or trivial stuff will definitely brighten you. 3. Remember those who are more miserable than you, and be thankful for what you haveThere are people with annual income of 2000$, disabilities, terminal cancer, people live in a warzone or conflict area… whose stories can be found easily with just a few clicks on the internet. There are also people around you who are unlucky to be forever trapped in the cruelty of fate that you might see them every day.If you have enough food not to starve, a shelter to hide, a hobby to entertain yourself, and enough cash to spend at your own will, you are blessed, much more than those people who is occupying 95% of the world’s population.Be thankful for what you have been taking for granted. 4. Cherish every small happy, delightful moment around youForget what the world is enjoying. Every little thing around you can be a source of happiness. Good food you have found, a good movie you soon watch, the time you and your partner spent together… Remember how tranquil and peaceful they were. Life isn’t made up of competitions, it is also composed of little cheerful things that are usually taken for granted. Don’t compare what you have with what the world has.Imagine the time when you don’t get to experience them anymore. 5. You still have a long run. Be resilient, strive to be a better self daily even it’s just a tiny bitDon’t deny the reality. Accepting your defeat, your failure is the beginning step to forge your new way to success. Don’t let this time failure get to your head, you had better commit yourself to something more fruitful and productive than dwell on the past. Even it is just a tiny bit, as long as you are better than your yesterday self, over the time it will snowball and become rewarding.Start learning a new skill, train every day. Start by setting an easy-to-aim achievement, then heighten it as you are used to the routine. 6. Finally: Treat yourself well, don’t skip meals, eat healthily, exercise oftenDon’t neglect your physical health. Good health is the foundation of a fulfilling life. No matter how distressful you are, feed yourself 3 healthy meals a day, create an exercise schedule from your 30-minute daily spare time. ConclusionYou feel like a loser when you involuntarily compare yourself with others while browsing social media, so you must first cut yourself off it. Social media is more insidious than you think, don’t let it control how you feel. Treat yourself more valuable time with great books, good food, satisfying outdoor activities, and chill out with those you treasure. Your mood will improve eventually, and you will regain the confidence to craft your future as you wish.","categories":[{"name":"lifestyle","slug":"lifestyle","permalink":"https://tsukie.com/categories/lifestyle/"}],"tags":[{"name":"experience","slug":"experience","permalink":"https://tsukie.com/tags/experience/"},{"name":"two-cents","slug":"two-cents","permalink":"https://tsukie.com/tags/two-cents/"},{"name":"self-help","slug":"self-help","permalink":"https://tsukie.com/tags/self-help/"},{"name":"mental","slug":"mental","permalink":"https://tsukie.com/tags/mental/"}]},{"title":"Lí do bạn nên viết technical blog bằng tiếng Anh","slug":"li-do-ban-nen-viet-technical-blog-bang-tieng-anh","date":"2019-01-29T03:35:32.000Z","updated":"2019-02-13T14:44:31.454Z","comments":true,"path":"vi/cong-nghe/li-do-ban-nen-viet-technical-blog-bang-tieng-anh/","link":"","permalink":"https://tsukie.com/vi/cong-nghe/li-do-ban-nen-viet-technical-blog-bang-tieng-anh/","excerpt":"","text":"Article available in Tiếng Việt Dev viết technical blog là trào lưu ở thế giới, hiện nay ở Việt Nam cũng có rất nhiều dev cũng đã bắt đầu tự có 1 trang blog của riêng mình. Bạn cũng đang là một developer và bạn đang chuẩn bị có 1 trang technical blog của chính mình? Cool, điều đó rất tốt! Bạn vừa có thể thể hiện được trình độ và kinh nghiệm, trải nghiệm của mình với mọi người, lại vừa có thể giúp đỡ những người khác nếu họ gặp những vấn đề mình đã giải quyết rồi. Hiện nay Việt Nam cũng có những nền tảng blog công nghệ thu hút đông người tham gia như viblo, kipalog… Có rất nhiều bài viết technical trên những nền tảng này của cộng đồng Việt Nam rất hay. Tuy nhiên, nếu bạn không hoạt động trên những nền tảng này, mà dự tính làm 1 website blog riêng, chạy trên 1 server riêng, viết blog bằng tiếng Anh sẽ có nhiều lợi ích bất ngờ so với viết blog bằng tiếng Việt! 1. Nâng cao khả năng vốn từ vựng và cách diễn đạt bằng tiếng AnhBạn sẽ phải tích cực tra từ điển, google từ vựng, ngữ pháp các kiểu v.v… để có thể viết được một bài blog tiếng Anh hoàn chỉnh ít lỗi nhất có thể. Thông qua đó, bạn sẽ biết được thêm những từ vựng tiếng Anh mới, những cách diễn đạt tiếng Anh mới mà bạn chưa bao giờ biết, hoặc trong quá trình google bạn bắt gặp những bài blog tiếng Anh khác và khi bạn đọc, bạn có thể tiếp thu được cách dùng từ, cách diễn đạt của tác giả bài viết đó. Dần dần, bạn sẽ nhớ được từ mới, ngữ pháp mới, điều này rất có lợi cho khả năng tiếng Anh của bạn, và thông qua việc đọc technical blog tiếng Anh trong khi google, bạn sẽ biết thêm được những vấn đề mới trong công nghệ được đề cập qua những bài viết đó. 2. Blog của bạn sẽ đến với nhiều độc giả hơnTiếng Anh là tiếng quốc tế nên tất nhiên số lượng độc giả đông hơn hẳn so với những ngôn ngữ còn lại. Đặc biệt là dev, khi google họ sẽ có xu hướng google bằng tiếng Anh trước khi google bằng tiếng mẹ đẻ. Ngay cả ở những quốc gia có cộng đồng dev trong nước cực kì lớn mạnh và tích cực như Nhật Bản hay Trung Quốc, số lượng người google bằng tiếng Anh (Trung Quốc thì là baidu bằng tiếng Anh :v) vẫn cực kì nhiều. Và ngay cả dev trong nước ta cũng vậy, mình có thể khẳng định rằng 99.99% dev trong nước ta khi google đầu tiên sẽ google bằng tiếng Anh :v không ai google bằng tiếng Việt trước cả :v vì dev thì mặc định là tiếp xúc với tiếng Anh thường xuyên, nên có những từ chuyên ngành không thể quy ra tiếng mẹ đẻ được, và dev thì tiếp xúc với tiếng Anh quen rồi nên họ sẽ đọc tiếng Anh rất tốt, và xác suất tìm được câu trả lời khi google bằng tiếng Anh sẽ cao hơn là bằng tiếng khác, hiển nhiên dev gần như lúc nào cũng sẽ google bằng tiếng Anh. Nếu blog của bạn viết bằng tiếng Việt, sẽ có 1 bộ phận những developer vẫn sử dụng tiếng Việt khi google tiếp cận được với blog của bạn. Nếu blog của bạn viết bằng tiếng Anh, không chỉ thế giới có cơ hội tiếp cận với blog của bạn, mà những dev Việt nhưng hay google bằng tiếng Anh cũng sẽ tiếp cận được với blog của bạn (số lượng dev này chiếm 99.99% trong tổng số những dev Việt dùng google :v). Tất nhiên, vẫn có những technical blog viết bằng tiếng Việt rất thành công, như toidicodedao.com là 1 blog nổi tiếng mình cũng rất thích đọc và đã mua sách của anh này. Tuy nhiên số lượng những blog như vậy không nhiều, và khi những nền tảng technical blog tiếng Việt mạnh như viblo hay kipalog đang nổi như hiện nay, khả năng blog của bạn trở thành 1 cái toidicodedao.com thứ 2 là khá khó. Mục đích chính của viết blog là để chia sẻ với càng nhiều người càng tốt. Do đó hãy viết technical blog của bạn bằng tiếng Anh. Nếu không có ai đọc blog của bạn, thì ít nhất bạn cũng có thể cải thiện nâng cao khả năng tiếng Anh của mình rồi :D 3. Những cơ hội bất ngờ mà blog đem lạiBlog viết bằng tiếng Anh thì không chỉ native speaker đọc, mà non-native speaker cũng đọc được, blog tiếng Anh thì người Việt Nhật Trung Hàn cũng đều đọc được hết. Khả năng mà 1 HR, 1 anh tech lead đẹp trai của 1 công ty nổi tiếng đọc được blog của bạn và tìm đến bạn cũng cao hơn là khi blog của bạn viết bằng tiếng Việt, thì các anh tech lead HR đẹp trai người Nhật Trung Hàn sẽ không đọc được, và không liên lạc với bạn để trao đổi cơ hội hợp tác nữa. Khi bạn ứng tuyển vào 1 công ty nước ngoài hoặc những công ty yêu cầu làm việc trong môi trường đòi hỏi tiếng Anh, nếu blog của bạn viết bằng tiếng Anh bạn có thể tự tin attach nó vào CV hay linkedin như một dẫn chứng tin cậy về việc bạn có khả năng sử dụng tiếng Anh như thế nào. Còn nếu blog của bạn bằng tiếng Việt? Bạn sẽ vất vả hơn trong việc tìm thêm những thứ chứng minh khả năng ngoại ngữ của mình với nhà tuyển dụng đó. Hiện nay, hầu hết những nhà tuyển dụng developer ở Việt Nam đều yêu cầu khả năng đọc hiểu tiếng Anh tốt, với những công ty có vốn ngoại quốc thì yêu cầu khả năng nghe nói viết tốt, IELTS above 6.5 v..v. Kể cả khi bạn chỉ tìm kiếm cơ hội ở trong nước, blog viết bằng tiếng Anh sẽ tăng khả năng đem đến nhiều cơ hội cho bạn hơn là blog viết bằng tiếng Việt. 4. OK tôi sẽ viết technical blog bằng tiếng Anh, hãy giúp tôiBạn cần có 1 từ điển chất lượng. Google translate có thể đáp ứng được hầu hết những gì bạn muốn dịch sang tiếng Anh. Tuy nhiên khi trình độ tiếng Anh của bạn đã lên tới một level nhất định, hãy hạn chế dùng từ điển Việt-Anh. Hãy dùng từ điển cắt nghĩa của 1 từ tiếng Anh bằng tiếng Anh. Mình recommend Oxford Advanced Learner Dictionary, ứng dụng có mặt trên tất cả các nền tảng software hiện nay. Khả năng cắt nghĩa từ vựng phổ thông lẫn chuyên ngành của ứng dụng này là vô đối, với giá chỉ 700k bạn đã có trong tay 1 ứng dụng từ điển tiếng Anh siêu việt của nhân loại rồi! Bạn cũng nên tìm mua thêm Oxford Advanced Learner Thesaurus Dictionary, nó có gợi ý nhiều ví dụ cho cách diễn đạt của 1 từ, những từ đồng nghĩa, trái nghĩa, giúp phong phú thêm khả năng diễn đạt của bạn khi viết blog. Nếu bạn dùng macOS, từ điển mặc định được cài sẵn trong macOS cũng rất mạnh rất tốt, hãy tận dụng nó. Tích cực đọc blog công nghệ trên thế giới, như medium, techcrunch, freecodecamp… Bạn học được phong cách diễn đạt của nhiều người trên đó và biến nó thành của mình. Dùng ứng dụng grammarly để proofread bài viết của bạn trước khi publish. Với bản free, grammarly có thể chỉ ra cho bạn những critical mistake liên quan đến ngữ pháp, như chia sai thể, thiếu trợ từ v..v. Với bản premium, grammarly có thể chỉ ra lỗi diễn đạt, gợi ý thay từ ngữ phù hợp… Nếu bạn coi trọng sự nghiệp viết lách của mình thì vài trăm nghìn 1 tháng cũng đáng, chịu khó nhịn bớt trà sữa đi là ok :))(Nếu bạn định mua grammarly cho 1 năm, hãy process purchase đến lúc checkout thì quit. Tầm khoảng 3 ngày sau grammarly sẽ gửi cho bạn 1 cái coupon discount 50% :) ). Nền tảng blog: Nếu bạn muốn blog cũng đồng thời là 1 skillset showcase của mình, hãy tự dev blog cho mình. Nếu bạn không muốn tốn tiền cho việc thuê server riêng, hãy sử dụng static site generator engine. Mình recommend Gatsby vì engine này sử dụng React và graphQL, trending technology hiện tại. Ngoài ra Hexo, Jekyll, Hugo cũng là những nền tảng rất nhiều dev đang dùng. Sản phẩm được generated bởi engine có thể host trên github.io. Bạn chỉ cần mua tên miền cài đặt vào là xong! Nếu bạn không ngại thuê server, bạn có thể sử dụng khả năng của mình để code nên 1 blog platform cho chính mình, laravel php ruby on rails nodejs các kiểu &lt;3. Tuy nhiên bạn hãy nhớ mục đích chính của blog vẫn là để viết, bạn dev blog đẹp pro elegant các kiểu xong viết bài không thấy ai đọc là bạn sẽ cảm thấy so defeated và quit nhanh chóng :(. Nên dev đẹp vừa thôi, còn để thời gian viết lách nữa &lt;3Còn nếu bạn chỉ muốn tập trung vào viết, wordpress là tốt nhất zero setup không phải nghĩ ngợi gì cho mệt. Thích theme gì plugin gì thì bỏ tiền ra mua giống anh toidicodedao.com vậy :D KếtViết blog bằng tiếng Anh vừa nâng cao khả năng ngoại ngữ, khiến blog của bạn đến được với nhiều người hơn, và tăng cơ hội nghề nghiệp cho chính bản thân. Tất nhiên, viết blog tiếng Anh sẽ tốn thời gian hơn so với viết bằng tiếng mẹ đẻ rồi. Hãy cố gắng vượt qua trở ngại đó! Chúc blog của bạn sẽ đến được với nhiều người!","categories":[{"name":"cong-nghe","slug":"cong-nghe","permalink":"https://tsukie.com/categories/cong-nghe/"}],"tags":[{"name":"blogging","slug":"blogging","permalink":"https://tsukie.com/tags/blogging/"},{"name":"kinh-nghiem","slug":"kinh-nghiem","permalink":"https://tsukie.com/tags/kinh-nghiem/"},{"name":"cong-nghe","slug":"cong-nghe","permalink":"https://tsukie.com/tags/cong-nghe/"}]},{"title":"Effectively manage row deletion using MySQL partitioning","slug":"effectively-manage-row-deletion-using-mysql-partitioning","date":"2019-01-26T10:29:08.000Z","updated":"2019-04-09T14:13:04.469Z","comments":true,"path":"en/technologies/effectively-manage-row-deletion-using-mysql-partitioning/","link":"","permalink":"https://tsukie.com/en/technologies/effectively-manage-row-deletion-using-mysql-partitioning/","excerpt":"","text":"Article available in English When you are about to delete some rows in MySQL, your first choice is usually using DELETE FROM. This is called hard deletion (or physical deletion). In fact, real-life business rarely uses this command when an immediate delete request is issued. More often than not, they use a technique called “soft deletion” (or logical deletion), which is implemented by adding a column named “deleted” or whatever with the same meaning to mark the rows as “deleted”. The purpose of this is to keep track of which rows were deleted, so as to inspect and easily revert changes if something goes wrong. However, with time the soft-deleted rows will start to clog up the database, which results in a performance decrease. After a certain period, soft-deleted rows have to be hard-deleted. However, querying soft-deleted rows followed by deletion with DELETE command will take quite much time and is prone to mistake. In this article, we will take a look at the method using partition to manage row deletion, which can be applied to a variety of use cases. 1. Review: What is partitioning Partitioning is a technique used to divide a database and its content into multiple parts. The primary use of partitioning is for load balancing. However, you can use partitioning to make large data more manageable, which is the gist of this article. There are 2 types of partitioning: Vertical and horizontal partitioning. While vertical partitioning involves table structure adjustment, horizontal partitioning splits a table’s content into multiple parts. The technique used to manage deleted rows in this article will utilize horizontal partitioning. According to Wikipedia, more than one table has to be created to implement horizontal partitioning. Fortunately, MySQL 5.6 and above comes with horizontal partitioning support out of the box. Defining a partitioning scheme and MySQL will take care of the rest. 2. Implement new row deletion mechanismAssume you have an already prepared table named receipt (How the table is structured is at your own idea). The first thing is to add 2 more columns, “disabled” and “month” to the receipt table. A simple ALTER TABLE should suffice. The “disabled” column will be responsible for keeping track of the soft-deleted rows. The “month” column will record when a row is updated (soft deletion is likely to be the last update query ever executed on a row, therefore “month” of a soft-deleted column will mark its deletion time in month). Execute a horizontal partitioning to this table by the MySQL code below1234567891011121314151617ALTER TABLE receipt PARTITION BY LIST COLUMNS(disabled, month) PARTITIONS 13( PARTITION pd0 VALUES IN ( (0, 1), (0, 2), (0, 3), (0, 4), (0, 5), (0, 6), (0, 7), (0, 8), (0, 9), (0, 10), (0, 11), (0, 12)), PARTITION pd1m1 VALUES IN ((1, 1)), PARTITION pd1m2 VALUES IN ((1, 2)), PARTITION pd1m3 VALUES IN ((1, 3)), PARTITION pd1m4 VALUES IN ((1, 4)), PARTITION pd1m5 VALUES IN ((1, 5)), PARTITION pd1m6 VALUES IN ((1, 6)), PARTITION pd1m7 VALUES IN ((1, 7)), PARTITION pd1m8 VALUES IN ((1, 8)), PARTITION pd1m9 VALUES IN ((1, 9)), PARTITION pd1m10 VALUES IN ((1, 10)), PARTITION pd1m11 VALUES IN ((1, 11)), PARTITION pd1m12 VALUES IN ((1, 12))) Let me explain what is happening here.The SQL code allows us to divide the receipt into 13 partitions, based on the value of the (“disabled”, “month”) tuple. The first partition, named “pd0”, stores all records that still haven’t been marked as “soft-deleted”, thus “disabled” value is 0. The following 12 partitions store all soft-deleted rows, which will be divided and arranged by deleted month. Create a MySQL trigger that activated when a row is soft-deleted. The trigger will modify the “month” column value to the month when that row is soft-deleted:1234567CREATE TRIGGER change_month_column_on_soft_deletion BEFORE UPDATE ON ｀receipt｀ FOR EACH ROW BEGIN IF old.disabled = 0 AND new.disabled = 1 THEN SET new.month := month(CURRENT_TIMESTAMP); END IF; END The code above is self-explanatory: Change the “month” column value to the month of the timestamp recorded when a row’s “disabled” column value is changed. Now our database will automatically organize soft-deleted rows based on the deleted timestamp’s month. The soft-deleted data must be emptied after a certain duration, therefore a crontab that automatically runs a bash file which will execute hard deletion on rows that marked soft-deleted x months ago (x based on the requirement of the project) needs to be created too. The SQL command to execute is straightforward: We only have to truncate the appropriate partition. The bash check today’s month and perform this SQL command123ALTER TABLE receipt TRUNCATE PARTITION pd1mx/* x is from 1 to 12, which partition will be truncated depends on a switch case that takes value from today's month */ The bash file’s executed routine should be once per month.TRUNCATE has a much faster execution time than DELETE FROM WHERE clause, the difference is profound when dealing with a large set of data. That’s how we take advantage of partition: Load balancing, ease of management and execution. 3. ConclusionInstead of “month” column, you can use the timestamp column of the table, in this case, the partition will be based on RANGE method. I simplified the example by only using the timestamp’s month so that you can quickly have a glance at how this mechanism works. The “disabled” column can receive other numbers than a binary flag, to indicate different layers of deletion.Soft deletion has some disadvantages too: The application code must filter soft-deleted rows when querying (this can be alleviated by using MySQL VIEW to do the filtering work), UNIQUE key and CONSTRAINT may not play gracefully when soft deletion is implemented, and storage management problems. However, in real life business, when data matters much more than storage cost, having soft deletion implemented can be a lifesaver. I would be happy if this article can aid you in choosing the proper way to manage deleted data.","categories":[{"name":"technologies","slug":"technologies","permalink":"https://tsukie.com/categories/technologies/"}],"tags":[{"name":"programming","slug":"programming","permalink":"https://tsukie.com/tags/programming/"},{"name":"software-development","slug":"software-development","permalink":"https://tsukie.com/tags/software-development/"},{"name":"mysql","slug":"mysql","permalink":"https://tsukie.com/tags/mysql/"}]},{"title":"I only realized these things when I was on the hospital bed","slug":"i-only-realized-these-things-when-i-was-on-the-hospital-bed","date":"2018-10-14T05:58:28.000Z","updated":"2018-10-14T06:51:52.260Z","comments":true,"path":"en/lifestyle/i-only-realized-these-things-when-i-was-on-the-hospital-bed/","link":"","permalink":"https://tsukie.com/en/lifestyle/i-only-realized-these-things-when-i-was-on-the-hospital-bed/","excerpt":"","text":"Article available in English Health is our most precious treasure, and only when we lose it, we start to realize that at that moment, our greatest desire is to bring back our health to normal. Every other gorgeous mirage that we are chasing daily starts to plummet, and we are able to clarify: What truly matters to us? 1. The hey-my-life-is-cooler-than-yours contest on social media is a total BS Every day I watch people’s brightest and coolest moments on my Facebook’s news feed, and I also try to have my best, bragging moments uploaded to Facebook. And I don’t know since when I have indulged in the endless human show off stage on social media. Only when I was confined to the hospital bed for a week, I realized the cruel truth: My received likes on Facebook cannot turn into medical expenses, and while people were pressing Like, giving comments to my statuses, those moments were fleeting and actually they didn’t give much damn. The emotional roller coaster from feeling superior to feeling inferior when surfing social media is poisonous, it harms my mental health in either way, like a zero calories junk food that gives no nutrition and induces cancer. I don’t deny the advantages of social media, but for me, the advantages are mediocre while the drawbacks far outweigh them. Actually, I don’t feel like I have drawn anything beneficial from browsing Facebook news feed every day. It only leads me down the procrastinator’s road and wastes my precious time. After recovery, I decided to rid myself of Facebook altogether, and keep Messenger only as a mean of communication. I realized that my life would be still handsome regardless of Facebook’s existence. No more show-off contest, no more checking notifications and news feed update. Living a life without Facebook in 2 weeks was so refreshing and tranquil. Yeah, I will miss people’s coolest moments, some events that I rarely participate in, some humorous posts that I watch with a poker face, some lectures about life that I have read countless times, and things that boost or hurt my self-esteem in an unhealthy way. Well f*ck it, what’s the matter then? 2. Means of financial safety is vital, and we should establish our safety net sooner Even though I’m living in a developed, first-world country with excellent health care and social welfare, the financial damage of being confined in a hospital for a week was absurd. My full-time work is my sole income source, so basically I generated no income during immobilization. And I was billed horrifically when I was discharged from the hospital. That left a big hole in my saving and I have to double my effort to make up for it later. That’s when I think of generating passive income and considering purchasing a health insurance policy. Passive income should help me keep my lifestyle stable without lowering the life quality too much compared to entirely depending on social insurance. And health insurance helps me cover medical expenses, even when social insurance covers a big part of costs, the left that I have to pay is still a significant sum of number. Purchased health insurance will alleviate this damage to my saving account. The problem is these two have to be done early to become effective. Working to generate passive income takes months or even years. And about health insurance, the sooner you purchase it, the more benefit you will receive. Purchasing it at a later time will invalidate the right to receive cover of diseases recognized before, and sometimes your purchase order will be outright declined. The time during hospitalization opened my eyes to make me realize: I gotta do something about these two before it is too late. 3. We can’t be on our own back all the time When I was at good health, I felt like I can do anything.When the only thing I could do is gaze at the intravenous drip, I felt powerless and hopeless.The moment people feel so in need of someone is when people fall ill. Life sucks when they become unable to do things that they would normally do.I grasped the meaning of this sentence during the hospitalized time “If you want to go fast, go alone. If you want to go far, go together”.I would rather go slower but farther, than go fast then go broke and never get up. 4. Health first before others When I was at good health, I wish for everything, strive for everything.When the only thing I could do is gaze at the intravenous drip, all I wish is to recover and get the heck out of this place quickly.Any problems will become minor once we lose our health. If we cannot look after even ourselves then what problem are we going to solve?No problem is really serious. No problem is really unique. As long as we keep our health in good state, we can somehow manage to overcome it.Don’t ever compromise with anything by letting it take tolls on your health, either physical or mental. You will regret later, inevitably. ConclusionAfter all, being immobilized in the hospital is not all that bad. A week hospitalized taught me many experiences that cannot be verbally explained. I will treat it as a chance to become a better person having a better life.Wish I never have to come back to that classroom again. Whew!","categories":[{"name":"lifestyle","slug":"lifestyle","permalink":"https://tsukie.com/categories/lifestyle/"}],"tags":[{"name":"experience","slug":"experience","permalink":"https://tsukie.com/tags/experience/"},{"name":"two-cents","slug":"two-cents","permalink":"https://tsukie.com/tags/two-cents/"},{"name":"mental","slug":"mental","permalink":"https://tsukie.com/tags/mental/"},{"name":"lifestyle","slug":"lifestyle","permalink":"https://tsukie.com/tags/lifestyle/"}]},{"title":"Tokyo: Enjoying good food without blowing the budget (part 1)","slug":"tokyo-enjoying-good-food-without-blowing-the-budget-part-1","date":"2018-09-09T01:56:23.000Z","updated":"2018-09-10T14:25:38.263Z","comments":true,"path":"en/travel/tokyo-enjoying-good-food-without-blowing-the-budget-part-1/","link":"","permalink":"https://tsukie.com/en/travel/tokyo-enjoying-good-food-without-blowing-the-budget-part-1/","excerpt":"","text":"Article available in English Japanese food’s standard is relatively high compared to the world. You don’t have to dine at a Michelin star restaurant, or a restaurant in a 5-star hotel to get all the best from the Japanese cuisine. The elegance of Japanese cuisine lies in inexpensive streets, in local eateries with dull-looking outward appearances. Definitely, it won’t cost you the earth to try the most wonderful food in Japan! Small reminderIf your time allows, enjoying food at lunch is much cheaper than dinner. The meal usually costs only as half as dinner, and some eateries close very soon.I will gradually introduce all Japanese dishes that I have tried in Tokyo in the series, along with the price for each dish, and the addresses too (if I still remember the places lol).Based on my personal experience I will give each picture a point to indicate the yumminess of it, with the max of 10.Now, let’s start our first journey to the kingdom of Japanese cuisine in Tokyo! Today is RamenJapan is well-known for ramen. You will be tempted to try all kinds of ramen when you arrive here. All variants of ramen are delightful, but personally, I found the Hakata tonkotsu variant suits me the best. Hakata-styled ramen usually is a mixture of small string noodle, wood ear mushroom (kikurage), chopped onion, seasoned egg (ajitama), slices of pork (chashu), salted sliced bamboo shoot (menma), and white, sweet scent of broth. Many people also claimed that the best ramen they had tried in Japan was Hakata style. Hakata-styled ramen restaurants often have a quiet, chill atmosphere. Besides the Hakata variant, the Yokohama variants are noteworthy too. Yokohama-styled ramen often uses big string noodle, thickly sliced pork, spinach, and deep brown, thick, greasy fatty broth. Many Yokohama-styled ramen restaurants (Yokohama kakei) have a tiny place, only a bar with around ten seats, and the restaurants often cultivate a boisterous, energetic environment. Therefore it might be best to taste the Yokohama-styled ramen going alone, and it might not be suitable for women. I also came across some variants which I couldn’t specify their origins. The verdictHakata-styled is a must try when you arrive in Japan, and fortunately, you don’t have to go all the way to Hakata to try this legendary ramen, as many places in Tokyo will offer this variant. Your safe bet is Ippudo (一風堂), they have established many branches globally so it means that they must have confidence in their recipe. Hakata-styled ramen restaurants often have a wide place, and they have an atmosphere of a normal restaurant so you can have your meal together with your friends. For Yokohama-styled ramen, you can rest assured that every Yokohama kakei (横浜家系, means Yokohama-styled) you try will likely taste the same. Since the restaurants are small, and the Yokohama-styled ramen restaurants are often loud and noisy, having your meal alone is going to be your best choice. Ramen is one of the Japanese dishes that brings Japanese cuisine to the world. Having your best bowl of ramen will leave you with beautiful memories when you think back to your time in Japan.","categories":[{"name":"travel","slug":"travel","permalink":"https://tsukie.com/categories/travel/"}],"tags":[{"name":"food","slug":"food","permalink":"https://tsukie.com/tags/food/"},{"name":"ramen","slug":"ramen","permalink":"https://tsukie.com/tags/ramen/"},{"name":"tokyo","slug":"tokyo","permalink":"https://tsukie.com/tags/tokyo/"},{"name":"japan","slug":"japan","permalink":"https://tsukie.com/tags/japan/"},{"name":"food-series","slug":"food-series","permalink":"https://tsukie.com/tags/food-series/"}]},{"title":"Mentality to fight against loneliness and depression","slug":"mentality-to-fight-against-loneliness-and-depression","date":"2018-07-09T14:44:13.000Z","updated":"2019-05-23T17:04:49.351Z","comments":true,"path":"en/lifestyle/mentality-to-fight-against-loneliness-and-depression/","link":"","permalink":"https://tsukie.com/en/lifestyle/mentality-to-fight-against-loneliness-and-depression/","excerpt":"","text":"Article available in English The source of loneliness and depressionMostly, they come from the environment outside of you. Specifically speaking, they are from other people that interact with you. Being isolated or unable to assimilate into your surrounding environment makes you sink in loneliness while receiving criticism or mockery depresses you. However, feeling lonely in an environment is more severe because you cannot find anyone to express your emotions and feelings, thus becoming more prone to depression. Nevertheless, these two are dangerous to your long-term mental health and must be treated accordingly. The solution differs depending on the suffering person, but basically, it will have something to do with the source. So, how can we try to get over them? 1. Practice individualism, being emotionally independent Don’t pay too much attention to what outside thinks about you, just enough to get your work done. Most of the time people’s wording is based on their current emotion, and there is absolutely no reason for you to down your mood with them. Don’t let verbal harassment or mockery hurt your mind, they cannot do any harm to you if you don’t let them do so. What cannot physically come into contact with you is harmless. You are the only one who can decide how your emotion will be. In some cases, you may show your outward emotion appropriately, but stay still inwards. Also, refrain from bending yourself to others’ requests. Not being comfortable will gradually let you free fall into depression, and you will eventually retaliate. Stop doing that from the beginning will help you avoid unnecessary emotional letdowns afterward. In many cases, you have to give in, remember that you only have to do it temporarily, do it outwardly to achieve what you want, stay intact inside, keep your mind positive. What doesn’t kill you makes you stronger. Thoroughly know what you are aiming at, what exactly is your need, and you are the only one who can control your emotion. This way, you will be emotionally independent, and remain invincible to outside influence. 2. Enrich your inner worldBeing isolated would have zero impact on you if you have practiced emotional independence. Your inner world will be a big help to boost your mental strength consistently. Make yourself a hobby that doesn’t relate to other people or anything that you don’t have total control, and immerse yourself in it. That can be anything, from reading, watching movies/animes/games, planting, coding… (stay away from anything competitive, as this will only drag your mood down more drastically). As long as you have unrestricted access to it, it will be a constant source to nurture your inner world. The more your inner world flourishes, the less you become affected from the outside. Just be sure that you are always able to access your hobby at your will. When outside emits negative impact towards you, go back to your inner world and disregard everything completely. Use your inner world as a method of meditation, and remain unwavering in this volatile universe. 3. Find a way to improve yourself regularly at your own paceDepression can also come from inward insecurity, which while indirectly related to the outward world, is something that you have to work on yourself. When you achieve emotional independence, the one and only thing to worry about is financial insecurity. Gear yourself up with marketable skills, improving them, expanding your network, keep yourself from heavily depending on a particular entity. Learn how to save, invest, and personal financial literacy. 4. Be minimalisticBe it a material object or mental object, minimalism lessens your worries, therefore lessens your depression. Keep only things that matter to you. Any mementos that ultimately have no relation or influence to your current and future life must be discarded. These will just set you and everything important to you back. Stop concerning what you cannot control. Enjoy your current life. Live at your own pace. Ignore outside noises. Minimalism builds your peace of mind, lay the solid concrete for you to start constructing your inner world effectively. 5. Expect less, talk less Expecting too much and be let down when things don’t live up to your expectation leads to depression. Lower your expectation as minimal as possible, and the blissfulness brought to you by the result that goes beyond your expectation will become tenfold. Do everything as you pour all your energy into it, but don’t expect it to reciprocate. Free your mind from expectation, and you will have nothing to sorrow. Don’t talk about your plans you are working on if it’s not necessary, give enough amount of information. You will not raise premature expectation from your beloved ones, and elicit humiliation from the rest, which adds up your stress and wear you out. Only talk if you have already finished them, or at least anticipated the outcomes certainly. In my opinion, however, the fleeting vanity gratification is not worth it. Don’t say any words at all if the situation lets you be able to do so. Researches pointed out that publicly announcing your goals makes you less likely to achieve them 6. Think about those who have to live a misery and unjust lifeIf you have enough food not to starve, a shelter to hide, a hobby to entertain yourself, and a constant allowance of any kind to spend at your own will, you are in the 5% blessed in the world. Be grateful for it, and free yourself from depression. Make your mind clean, and start thinking for your way out of the situation that delivered depression to you, positively. FinallyEat banana. This may sound like a joke, but scientific researches said that banana contains elements that can help relieve stress and depression, improve mood and have a good effect on your neural system. So if you are sad, kind of let down or your sanity is not in a sound state, treat yourself a banana. Hopefully, before you dwell on depression to the extent that you find yourself on the edge of the railway, this can be somewhat salvation to you. The article was composed from my experience, random Quora posts and the book that who just have stepped into adulthood have to give a read: “The Subtle Art of Not Giving a Fvck: A Counterintuitive Approach to Living a Good Life“","categories":[{"name":"lifestyle","slug":"lifestyle","permalink":"https://tsukie.com/categories/lifestyle/"}],"tags":[{"name":"experience","slug":"experience","permalink":"https://tsukie.com/tags/experience/"},{"name":"two-cents","slug":"two-cents","permalink":"https://tsukie.com/tags/two-cents/"},{"name":"self-help","slug":"self-help","permalink":"https://tsukie.com/tags/self-help/"},{"name":"mental","slug":"mental","permalink":"https://tsukie.com/tags/mental/"}]},{"title":"How to reset trial time for Jetbrains products","slug":"how-to-have-unlimited-trial-time-for-jetbrains-products","date":"2018-05-27T09:00:25.000Z","updated":"2019-05-17T14:48:37.569Z","comments":true,"path":"en/technologies/how-to-have-unlimited-trial-time-for-jetbrains-products/","link":"","permalink":"https://tsukie.com/en/technologies/how-to-have-unlimited-trial-time-for-jetbrains-products/","excerpt":"","text":"Article available in English Ran out of trial period and you would like to have that period extended a little bit more, but you don’t feel like contacting the customer support, nor you don’t want to use a pirated copy either. What should you do?In this article, I will introduce a way to reset the trial period to its full duration from the beginning (30 days). As long as you reset the trial period when it begins to time out, you can virtually use the product in “trial state” for unlimited time!The tutorial was done on MacOS, but Window users should not have any problems finding a similar way to follow the tutorial (through the setting files in the hidden folder in Document folder and registry). You have to edit the host file too (to block the connection between the product and its server), but the pattern is the same for both OS.This reset trial guide should work with almost every standalone IDE of Jetbrain, such as IntelliJ Idea, PhpStorm, WebStorm, PyCharm, RubyMine.Let’s get our hand dirty! 1. Terminate your JetBrains application2. Remove all *.key files in ~/Library/Preferences/&lt;Your Jetbrains product name&gt;/eval/ folder 3. Remove ~/Library/Preferences/&lt;Your Jetbrains product name&gt;/options/options.xml fileIn the picture above, the options folder and eval folder are in the same parent folder. (adsbygoogle = window.adsbygoogle || []).push({}); 4. Remove any Jetbrains related keys in ~/Library/Preferences/com.apple.java.util.prefs.plist file 5. Remove all JetBrains related plist files in ~/Library/Preferences/6. RESTART YOUR COMPUTER (this is important since OS caches all the preferences. You have to restart OS for the new preferences to be fetched)7. Block connections to JetBrains serversOpen your host file (in MacOS the host file is located at /etc/hosts). Append these two rows to your host file12127.0.0.1 www.jetbrains.com127.0.0.1 plugins.jetbrains.com (adsbygoogle = window.adsbygoogle || []).push({});You can also use other applications to block your JetBrains product’s internet connection (note that the application you use must be able to block outgoing connections). In MacOS I’m using Little Snitch to do this job for me (you can use a demo version of Little Snitch because JetBrains products seem to only connect to their server the moment they are launched, no periodically initiated connections so the demo version will work fine).If you opt for using Little Snitch, the configuration might be tricky so I pasted my configuration here for you. The application is pretty anal about application code signature so you have to google things a little (the result is at the top of the first page so you should not have any troubles following the guide to tweak the setting to fit your needs). 8. Finally, run your JetBrains product, select Evaluate for free and enjoy your renewed trial period!This article is not supposed to be used for pirating, but if you find yourself short of time and/or you cannot find any reasonable excuses to have the customer support extend the trial period for you, then this article can become a life-saver. When you finish with the trial and decide to purchase the product, wipe everything related to your JetBrains product from your computer just in case.","categories":[{"name":"technologies","slug":"technologies","permalink":"https://tsukie.com/categories/technologies/"}],"tags":[{"name":"programming","slug":"programming","permalink":"https://tsukie.com/tags/programming/"},{"name":"software-development","slug":"software-development","permalink":"https://tsukie.com/tags/software-development/"},{"name":"jetbrains","slug":"jetbrains","permalink":"https://tsukie.com/tags/jetbrains/"}]},{"title":"How are new hire software programmers expected to be?","slug":"how-are-new-hire-software-programmers-expected-to-be","date":"2018-05-24T12:43:40.000Z","updated":"2019-04-09T14:13:04.470Z","comments":true,"path":"en/technologies/how-are-new-hire-software-programmers-expected-to-be/","link":"","permalink":"https://tsukie.com/en/technologies/how-are-new-hire-software-programmers-expected-to-be/","excerpt":"","text":"Article available in English If you’ve just got a programmer job from your dream company, congratulation! There is nothing as blissful as that. Your programming skill got you to layers of interviews and you made it to the offer stage, of course you are proud of it. However, programming in a corporate environment is not like solo coding, individual programming skill won’t get you a promotion. Knowing what your company expects from you and leaning towards them will pretty ensure a smoother career for you to display your coding talent further. 1. You are not expected to shine on your very first dayNo matter what position you were hired to be, your very first day will be getting familiar with the existing system, the workflow, and your colleagues. You are expected to ask a lot of questions, make some mistakes, and learn them on the way. Don’t be so eager to point out any flaws in the current system, criticize them (unless they are freaking critical that would corrupt the whole business), or immediately interrupt your mentor if they are talking about something you have known already. Doing so will bewilder your mentor, your colleagues, and inevitably they will start thinking of you as a newcomer asshole, which is not good if you are going to stick with them for a while. Also, you are not expected to try hard on your first day. First, getting used to the system, learning about the workflow, the working culture, your colleagues’ working habits, and adapt to them at your own pace. Doing great work on your first day will only raise the premature expectation on you, keep you busy to live up to it, and end up making you burnt out later. Therefore, knowing and adjusting yourself to be suitable for a long run would be a wiser and smarter choice. Lower your standard, and heighten it later. 2. To learn, you have to unlearnGuess why companies prefer freshers to mid-careers? Freshers don’t need time to unlearn what they were stuffed in the previous workplace! They will quickly get used to the working environment and be able to provide the result promptly and efficiently. Every workplace has its own internal rules and workflows, the quicker you familiarize yourself with them, the faster you will thrive. Even though the workflow of a business that worth billion dollars seems superior to the workflow of a venture, it doesn’t necessarily mean that venture must change their workflow at once. Many workflows struggle in large corporations but shine in ventures. Or the reason that a venture hasn’t switched their workflow to something better is that they have a particular reason which is holding them back from improving. Even though your former company has a superb workflow in contrast to your current company, instead of criticizing, try to understand it. There always has multiple ways to solve a problem. This also applies if you are a graduate fresher. Principles, laws, design patterns you have learned in your university may only be partly usable in the corporate environment. Profit, economy, and efficiency are the most prioritized matters there. Everything you have learned in the university may be bent to fit into the bigger picture. Differing from the standard doesn’t mean wrong, the only thing that matters is the outcome. By accepting it as part of your job and getting used to it, you will become more flexible, improve your problem-solving skill, learn new ideas and broaden your career path. 3. Learn to cope with the existing systemBefore improving a part that was already up and running, look for every place that the change might affect. If the effect is too huge, or the improvement dramatically raises the labor cost, let’s overlook it for now.Every programmer encountered at least once in their career life a spaghetti code, a bad software design, or anything that went against the Bible of Good software programming. I know a system serving about 200k users at the moment that doesn’t employ 1-n relation in its database design. Instead, the table has to be altered by adding a column manually each time the related data is increased. If the data is increased by about 100 records, there will be 100 more columns added to the table! Sounds catastrophic right?Of course, if columns are frequently added that way, definitely the system design must be reconsidered. But how about only one or two columns would be added in a decade?In this case, let’s put up with it. Even if you try to change the database to the correct design standard, there is a good chance it will affect other existing parts that you completely have no ideas why they were related, cause mountains of regression bugs, trouble thousands of users, and may eventually fail the whole system!And you will meet more bad designs as your career advances. OOP bad design, bad code, repetitive code, fabulously nested if-else structure… anything you can name. If those are in an in-house project and it hasn’t been released yet, improvements are much more negotiable. However, when the product was launched and started serving users, current user state and system condition must always be kept in mind when introducing new improvements. More often than not, your team members will deny any changes that produce mediocre visible enhancements but could induce regression bugs and potential system failure.So, if you come across a duplicate code, a terrible OOP design or something alike in your company’s commercial products, or your client’s running system, discuss with the people in charge before making any improvements. If you have to make some changes to the existing system, the way that complies with the design standard may not be the best. Choose a way that the number of parts you have to change accordingly is the smallest. 4. ConclusionHopefully, my experience could be somewhat useful to you, even if you are a sparkling graduate fresher with an A+ grade or you are a seasoned developer who has just started the first day in the new office. In the workplace, you will be inevitably challenged to embrace more than just pure programming skill. Do not limit yourself to what you have learned, be open-minded, selectively adapt yourself to what corporation expects and you should be fine and continue to thrive in your programming career.","categories":[{"name":"technologies","slug":"technologies","permalink":"https://tsukie.com/categories/technologies/"}],"tags":[{"name":"software-development","slug":"software-development","permalink":"https://tsukie.com/tags/software-development/"},{"name":"experience","slug":"experience","permalink":"https://tsukie.com/tags/experience/"},{"name":"two-cents","slug":"two-cents","permalink":"https://tsukie.com/tags/two-cents/"}]},{"title":"株の長期投資にあたっての分析すべき指数","slug":"kabu-no-chokitoshi-no-shisubunseki","date":"2018-04-14T05:29:46.000Z","updated":"2019-05-23T17:09:36.102Z","comments":true,"path":"ja/jinsei-seikatsu/kabu-no-chokitoshi-no-shisubunseki/","link":"","permalink":"https://tsukie.com/ja/jinsei-seikatsu/kabu-no-chokitoshi-no-shisubunseki/","excerpt":"","text":"Article available in English | 日本語 株といえば株価の値上げ下げが激しいチャートとか、株価の追いかけ・タイミングとかすぐに思いがちでしょう。確かに、デイトレーダーにとっては株価の差は利益になりますが、実は株価はもっとも情報が少ない指数なのです。しかも、株式売買による株価の差の利益を狙うのはなおさらです。過去の価格履歴を見て将来の株価を推測するのは、賭けに等しいです。株価は毎日激しく変わっています。そして、証券会社での取引中の株数、実は発行された株数の約５％しか占めていないという事実があります。取引株式の株価で発行会社の価値を決定できることはあり得ないでしょう。では一体何の指数を注目すべきなのか、愚意でありながら、自分の読んだもの、そして自分が経験したことをまとめてあげさせていただきます。建設的な批判はいつも大歓迎です！ 1. 一株あたりの当期純利益（EPS - Earning per share）EPS = 純利益（net income）/ 発行済株式（share outstanding）当期に一株につきいくらくらい設けたのかを示す指数です。計算式は上記のように、純利益を発行済株数で分けます。長期にわたってこの指数は下がらずに順調に上がっていったら会社の発展は著しいともいえるでしょう。 2. 株価収益率（PE - Price/Earning）PE = 株価 / EPSこの株を買って儲かりそうなのか、最初にこの指数を一回見てみなければならないとよく言われています。計算式は一株の単価を一株の当期純利益で分けます。簡単にこの指数を解説すれば、「ＰＥはＸだったら、株を買う金額としてＸ円につき、毎年１円を儲けることが期待できる」というのです。ウォーレン・バフェットはＰＥが１５より低い株式を好むそうです。ＰＥが低ければ低いほど儲かる金額が高くなる可能性が高いです。逆に、ＰＥが非常に高い場合（アマゾンの株のＰＥは現在３００を超えました）は、利益は価格に比較してただわずかで、長期に渡っても自分の儲かる利益は投資金額に対して海に振る塩です。 3. 配当利回り（Dividend yield）配当利回り = 一株あたりの配当金 / 一株の単価 * １００％この指数は単なる一株にあたりの配当金と一株の単価の割合です。例えば自分が買った株の単価は一株１００￥で配当利回りは５％だとしたら、毎年５￥配当金がもらえます。もちろん、配当金を支払いしない会社に対しては配当利回りも計算できません。経験則上では配当金を支払う会社の株の方がいつも望ましいらしいです。 4. 負債・純資産率（Debt/Equity）DE = 負債合計 / 純資産合計この指数は貸借対照表での負債合計対純資産合計の比率です。貸借対照表では総資産、負債、純資産が清算してあります（総資産 = 負債 + 純資産）。DEは軽く会社の財務状況を示します。もしDEは１より低ければ、安定して成長し続けることが見込めます。２より大きい場合は、もっと調べる必要があります。負債は純資産よりずっと大きければ大きいほど会社が倒産しやすくなってしまいます。 5. 一株あたりの純資産（BPS - Book value per share）BPS = 純資産合計 / 発行済株数計算式は上記のように、発行済株数で純資産合計を分けます。簡単に説明すると、倒産する会社を清算し、全ての負債を納付した後、残りの金額を発行済株数で分けたら、一株あたりの金額はＢＰＳと言います。この値は株価が高値か安値かを測る標準として活用されています。ですが、株価がＢＰＳより大きい・低いから必ずしもこの株は高値・安値であるわけではありません。ＢＰＳより大きい価格を持つ株を買う人は、将来その株の会社がもっと発展して、株の価値ももっと上がることを期待しています。会社の発展は限りのないものです。しかし、ＢＰＳは絶対の物差しだと思い込むことも随分危険です。会計方針によって、この値も大きく変動します。ＢＰＳだけを信じて全体的に見て考慮しなければ騙されるかもしれません。 6. 自己資本利益率（ROE）ROE = 純利益 / 純資産合計 * 100%損益計算書と貸借対照表にそれぞれ純利益・純資産が記載してあります。ROEが年々に渡って安定的に上がるならその会社が安定的に利益を儲けるという意味もありますし、絶対に株価も上がるでしょう。毎年のROEが１０％以上でしたらその会社の経営状況は絶好調ということです。 最近コンピューターやインターネットの補助のおかげでこれらの指数は簡単に取得できます。手動で計算することなく、銘柄をググればほとんどの指数を出してくれます。他のサービス（ヤフー、ブルームバーグ、野村）も最近の四半期をまとめて網羅的な情報を提供しています。各指数を見て買うか買わないかを判断するくらい手軽です。 実際の四半期決算書も一回読んでみましょう。こちらはさっきググったＪＦＥ銘柄の最近四半期決算書です。損益計算書と貸借対照表をざっくりみて、上記６指数を計算して、当期どのような発展をしたのかイメージを捉えましょう。 まず２０１７年の1株あたりの純利益を計算しましょう。すでに計算してあります （２４０.４２円）が、これは当期純利益分ける発行済株式です。 次は株価収益率を計算しましょう。上記ググった株価（２２５４円）を取ったばかりの1株あたりの純利益（２４０.４２円）で分けたあと、９.３の比率が得られます。まあまあですね。 よく関心される配当利回りを計算しましょう。２０１７年度は２回配当金が支払いされました。合計1株あたり６０円の配当金が得られます。よって、配当利回りは６０ / ２２５４ * １００％ = ２.６６％。かなりいい比率です。 負債・純資産率を計算するときに貸借対照表を見ます。２０１７年度の負債合計は２４２８２４０百万円で、純資産合計は２０１２６０７百万円です。よって、負債対純資産比率は２４２８２４０ / ２０１２６０７ = １.２ です。１より大きいですが、非常に大きいではありませんし、順調に利益を儲けたら大丈夫でしょう。 株価は高値か安値かを知りたければ、1株あたりの純資産を計算して見てみないと推測できません。上の画像に書いてある発行済株数は６１４４３８３９９です。さっきの取得した純資産合計値は２０１２６０７百万円ですので、これらで1株あたりの純資産値は２０１２６０７ * １０^６ / ６１４４３８３９９ = ３２７５として算出できます。今の株価は２２５４円なんでこの株はお得だ？とは限りません。他の要素も慎重に検討すべきです。 そして最後自己資本利益率を算出すれば終わりです。上の画像に記載された純利益は１３８６２０百万円です。純資産合計は２０１２６０７百万円です。なので算出される自己資本利益率は１３８６２０ / ２０１２６０７ * １００％ = ７％です。大きな数字ではありませんが、利益が伸びていますね。 ざっと四半期計算書に目を通した後、この銘柄は安値で、配当利回りもいいですし、PEもそんなに高くありませんし、有望な銘柄かもしれないことがわかりました。これらに基づいて、より深く研究していく価値があるでしょう。 以上は株購入にあたっての基本の指数を述べさせていただきました。もちろん、これらの指数だけである株がいいかよくないか決めつけることはできませんが、これらを介して会社の概ねの経済状況、市場状況、そして将来の可能性を把握することはなんとなくできるでしょう。これらを標準として、有望な銘柄を推測してもっと調べる助太刀に役に立ちます。もし自分の好みのある銘柄がありましたら、これらの指数で経済的な面でその銘柄を見てみましょー！ 主な参考はWarren Buffett’s 3 Favorite Booksからでした。この本の著者はよく知られている人物ではありませんが、タイトルで述べられた３冊の本を巧みに、そしてわかりやすくまとめてくれました。初心者でも問題なく読み取れるはずです。One up on Wall Street, Security Analysis, A random walk down Wall Streetのような有名なタイトルを楽しむ前に、基礎の知識を補足するのにこの本をご一読いただくことを大変オススメします。 P/S: 株投資はそんなに難しいものではありませんが、簡単でもありません。最初に大量の時間・お金を費やすことになりえます。他に楽で、安心に投資できそうなオプションといえば、インデックスファンド（日経２２５等）、ETF、投資信託は一応調べ甲斐があります。自分でポートフォリオを組んでしくじるより、運営プロに任せた方が良いかと思っています。","categories":[{"name":"jinsei-seikatsu","slug":"jinsei-seikatsu","permalink":"https://tsukie.com/categories/jinsei-seikatsu/"}],"tags":[{"name":"kabu","slug":"kabu","permalink":"https://tsukie.com/tags/kabu/"},{"name":"keiken","slug":"keiken","permalink":"https://tsukie.com/tags/keiken/"}]},{"title":"Principal indices in stock analysis for long-term investment","slug":"principal-indices-in-stock-analysis-for-long-term-investment","date":"2018-04-10T13:55:34.000Z","updated":"2019-05-23T17:01:06.252Z","comments":true,"path":"en/lifestyle/principal-indices-in-stock-analysis-for-long-term-investment/","link":"","permalink":"https://tsukie.com/en/lifestyle/principal-indices-in-stock-analysis-for-long-term-investment/","excerpt":"","text":"Article available in English | 日本語 Most investors who have just begun their investing career tend to prioritize stock price information and the market chart. While these pieces of information might be relevant in the short term, trying to guess the market or time the best moment for purchasing is futile. Base the future stock price on the stock market history is like a gamble, and the odds of timing correctly is like the odds of hitting the jackpot. The stock market fluctuates every day, and the current trading shares only occupy about 5% of the total share outstanding, therefore thinking of 5% shares deciding the value of a whole business is just hilarious. In fact, long-term investors often see the stock price as the last factor that should be taken into consideration when purchasing a stock. From what I’ve read and my hands-on experience, I humbly note some of the indices that should be analyzed first when planning on investing in a stock. Hopefully, it may come handy for future investing newcomers. Constructive criticism is always welcomed. 1. Earning per share (EPS)EPS = Net income / Share outstandingThis means the amount of profit one share made at the time it was analyzed. It is calculated by dividing the net income (income after deducting taxes and other costs) to the share outstanding (total shares currently traded on the market). Consistently increasing EPS throughout years is usually a good sign of a company’s growth. 2. Price/Earning (PE)PE = Stock price / EPSThis index is the most prioritized to be looked at when analyzing a company’s performance according to a large number of investors. It is equal to the price of a single stock divided by EPS. Literally, it means ‘If a PE of a stock is equal to X, then for every X dollar spent on buying the stock, it is expected to make 1$ profit every year’. Famous investors often prefer stocks that have PE below 15. If you see a stock that has a PE of hundreds (like Amazon), then it is grossly overpriced and will not make much profit for you even in long-term. 3. Dividend yieldDividend yield = Dividend rate / Stock price * 100%This is simply the percentage between dividend you will receive per share and price per share. For example, if your stock is priced at 100$ per share and has a dividend yield of 5%, that means one share will return you 5$ a year. Note that if a company does not pay its shareholders dividend, then there will be no dividend yield either. As a rule of thumb, stocks that pay dividends should be favored over stocks that don’t pay dividends, unless the stocks that pay no dividend have a solid value that increases every year. 4. Debt/EquityDE = Total liabilities / total net valueThis index is calculated by dividing its total liabilities to its total net value. The value of liabilities and net value can be found at balance sheet (note that total liabilities + total net value = total assets). Debt/Equity reflects part of the company’s current financial situation. If this index is less than 1, then the company’s financial state is quite reassuring. If it is more than 2, double check other performance indices before deciding to own the stock.One related index is debt/asset, which is the percentage of debt to the total assets. A number above 70% means necessary caution when proceeding to invest in the stock. 5. Book value per shareBook value = Total net value / Share outstandingThis value is calculated by dividing the total net value to the share outstanding. If a company goes bankrupt, has to liquidate all of its assets to cash, pay all its debts and divide its leftover to all the available shares, then this value represents how much a share will receive. This value plays the role of a safety ruler: comparing the stock price to its book value to see how much it is overpriced, or underpriced. When people purchase a stock that has the premium price compared to its book value, they are expecting that the stock will make more money in the future to compensate for the overpaid amount. Don’t buy into this value excessively though, based on the accounting method it will vary from high to low. 6. Return on equity (ROE)ROE = Net income / Total net value * 100%The net income can be found in income statement and the net value can be found in balance sheet. A consistently growing ROE in every year is equal to the huge potential of a company’s advancement, and the rise in its market price. It is said that an ideal ROE number is often 10% or higher. Actually, you don’t have to manually find the necessary elements in the balance sheet and calculate these indices yourself. With the aid of a computer, getting these numbers is a breeze. Just type “your stock name + stock” in Google search and the rich context result will be returned with all of our concerned values. Let’s also try tackling a basic financial report analysis manually. Here is the latest financial report of JFE Holdings that I searched earlier. This report includes an income statement and a balance sheet. We need to calculate the six principal indices to get a summary of how this company performed throughout a year. On page 1 the EPS was calculated for us (Net income per share). If you want to try calculating it yourself, find the Number of outstanding shares (common stock) in page 2 and divide it to the Profit attributable to owners of parent (it means net income, just different wording). The PE is calculated by using the stock price we searched earlier (2201¥ - Report don’t track stock price) and divide the value by the EPS (240.42¥). We get 2201 / 240.42 = 9.15, which is a reasonable ratio. In 2017, each share is expected to yield a dividend of 80¥. Given the stock price at 2201¥ per share, the dividend yield is equal to 80 / 2201 * 100% = 3.63%. Above 2.5% is a premium rate! To calculate DE, let’s take a look at the balance sheet on page 5. In 2017 the total liabilities were at 2,428,240m¥. The total net assets were at 2,012,607m¥. Thus the DE was 2,428,240 / 2,012,607 = 1.2. As long as the company is still able to make a steady income, 1.2 is not a worrisome ratio. We just had the net assets value of 2,012,607m¥, let’s divide it to the share outstanding to get the book value per share. The share outstanding number is 614,438,399, therefore book value per share is 2,012,607m¥ / 614,438,399 = 3275¥. Currently the stock is selling for 2201¥ per share, so obviously it is being undervalued (?! as above said it is just a mean of measure don’t buy into it too much). Finally, get the percentage between net income (Profit attributable to owners of parent on page 1 - 138,620m¥) and net assets (2,012,607m¥) and we acquire a ROE of about 7%. Not a big number though… After a little attempt on deciphering the financial report, we now have a simple overview of this stock. This stock is currently undervalued, good dividend yield and a not bad PE ratio. Every index compared to its previous year’s counterpart shows sign of improvement. It deserves further researches. Above are the most significant indices that appear in every stock evaluations. Although to be able to decide whether a stock is worth purchasing we have to consider many other aspects, these primary indices can get you a picture of a company’s current financial condition, its market state, and its future potential. They provide the standard for you to assess a stock value easier, and a good basis to evaluate the stock further. If you have your favorite brands, and intend to own some of their shares, these indices will surely assist you on your way to the very first investment step. This article is a brief memo of Warren Buffett’s 3 Favorite BooksAlthough the author is not that well-known, he was able to nicely summarize the gists presented in the three must-read investment books and his way of writing and collecting ideas let even the dumbest person be able to digest all the foundations in the mentioned books. If you are new to investing, before reading the notorious One up on Wall Street, Security Analysis, A random walk down Wall Street, this book is a solid recommendation for you to have a grasp of all the basics and continue enjoying the best-sellers later. P/S: If you find investing in individual stocks too daunting and lots of hassle, ignore them and buy index fund / ETF / mutual fund instead. Generally, these options outperform many other portfolios, and will save you time, money and headaches (pun intended).","categories":[{"name":"lifestyle","slug":"lifestyle","permalink":"https://tsukie.com/categories/lifestyle/"}],"tags":[{"name":"experience","slug":"experience","permalink":"https://tsukie.com/tags/experience/"},{"name":"two-cents","slug":"two-cents","permalink":"https://tsukie.com/tags/two-cents/"},{"name":"stock","slug":"stock","permalink":"https://tsukie.com/tags/stock/"}]},{"title":"My 5 circled career aspects that need improvement","slug":"my-5-circled-career-aspects-that-need-improvement","date":"2018-03-03T01:50:36.000Z","updated":"2018-09-09T02:34:23.562Z","comments":true,"path":"en/lifestyle/my-5-circled-career-aspects-that-need-improvement/","link":"","permalink":"https://tsukie.com/en/lifestyle/my-5-circled-career-aspects-that-need-improvement/","excerpt":"","text":"Article available in English There was a post I read long ago, it was an article telling Warren Buffet instructs people how to select and prioritize their goals from their seas of todo task lists. The instruction was “listing your 25 goals you desire to achieve them, circle 5 things you decide that they should have the most priority to be focused, and others that you decided not to circle them become your distraction list”. Planning goals is the most essential step, ensure that we will not waste a single of our effort pouring into things that give off a mediocre result. I also tried and clarified my list, to deliberately complete them gradually. They are not something that can be accomplished in an afternoon, they have to be given daily attention, and their progress should have to be checked periodically. This way, we can make sure that how much things have advanced, and be motivated to continue them the following day. 1. Venture into the investment fieldWhen I was younger, hearing “stock”, “share”, “investment” felt like they were powerful entities that only privileged people were able to touch them, and those who were not qualified but still tried to take part in would be doomed to eternal poverty. After a while, understanding that investment is a form of making a fortune and stock/share is a method of investment, the past things became less complicated than they used to be. Since I do not have much expertise in stock investment, and I do not have time to become a day trader, I chose the safer way to begin as a layman in investment field: Buy share from large corporations, hold it and receive annual dividends. This way, I will have less worry about the fluctuation of stock prices, and my precious time can be used for improving other aspects of my life. 2. Put serious effort into English skill bettermentFor a while, I neglected to improve my English skill continually, I mumbled to myself that being able to read and grasp the gist of technical articles, understand answers written on StackOverflow is more than enough.It definitely helps if we can freely use foreign languages other than English, as it gains us more advantage compared to other candidates in competitive situations. However, mastering English will undoubtedly benefit in the long run. And by “serious effort”, I mean that the outcome has to be measured in a way that can be visually confirmed, like a certificate. With a routinely dedicated effort, a positive way of studying, and an aid of passive learning, an overall band 7 in general English test might not seem so overwhelming after all. To be always prepared in a world that becomes more and more volatile, an indispensable survival tool like English cannot be ignored. 3. Be a relentless writerBlogging is not only for keeping notes and memories, but it is also a popular way of expressing oneself. Expressing ideas and opinions smoothly through writing is a vital skill in modern life. Just by purchasing a domain and a host and we are able to get our own personal space on the Internet to draft anything that comes to mind. The feeling of having a tiny space somewhere on the Internet that belongs to us is so compelling that anyone would be inclined to buy a domain for themself. And to not waste that precious tiny space, we should write regularly. It is not necessary to write daily if our timetables are clogged with plans, but it should be scheduled. By having a habit of writing, our skills should be gradually improved. If posts accumulate enough and the blogging is done properly, we may even attract, and up our popularity, we can even make business with our blogs. Sounds cool?Practice writing in our leisure time is also a good habit to adopt, just make sure that we got our best dictionaries to assist us if we choose to write in a language that we haven’t been comfortable with it yet. 4. Improve skill as a software programmerHaving an ability to write or understand programming codes, or being skilled enough to tackle software development in this modern world is equivalent to being blessed. While other industries can experience stagnation at times, technologies are continually flourishing and have never shown signs of pause. That said, merely being a programmer is not going to ensure stable employment, let alone well-earning position. To make a living in software industries requires solid skills and stopless, deliberate practices. The more we can understand a popular language and how it works under the hood, the better. As a software programmer, I found that the ability to continue to master our already known technologies while keeping up with the latest updates must be built into our instincts. In a rapidly changing world, these will be essential.Doing a side hustle, developing a small tool or app as a hobby, or just turning anything that comes to our mind into codes is a good way of practicing and maintaining our skills, because programming skill will become rusty over time and in order to remain competitive enough it has to be sharpened. 5. Adopt new skills for the future(That said, polishing the already possessed skills is always easier, requires less effort and we can measure our progress daily. Maybe I will reserve this for later.)","categories":[{"name":"lifestyle","slug":"lifestyle","permalink":"https://tsukie.com/categories/lifestyle/"}],"tags":[{"name":"lifestyle","slug":"lifestyle","permalink":"https://tsukie.com/tags/lifestyle/"},{"name":"trivia","slug":"trivia","permalink":"https://tsukie.com/tags/trivia/"}]},{"title":"AFC U23選手権ベトナム：サッカーを超えるものになった時","slug":"afc-u23-senshuken-betonamu-sakka-o-koeru-mono-ni-natta-toki","date":"2018-01-28T06:15:25.000Z","updated":"2018-08-29T14:05:58.780Z","comments":true,"path":"ja/jinsei-seikatsu/afc-u23-senshuken-betonamu-sakka-o-koeru-mono-ni-natta-toki/","link":"","permalink":"https://tsukie.com/ja/jinsei-seikatsu/afc-u23-senshuken-betonamu-sakka-o-koeru-mono-ni-natta-toki/","excerpt":"","text":"Article available in 日本語 今週はベトナム全国に対して特別な一週間でありました。初めてアジア州規模の大会に出るベトナムチーム。そして、決勝戦まで勝ち抜いたのは、チーム自体にとってだけじゃなくて、全国のベトナム人民にとっても全国パーティを催すほど光栄な機会です。 多分ご存知でしょう、ベトナムは不満を訴える人が少ない国ではないようです。特に、まだ十分に世を知らない人たちである若者は頻繁に訴えます。口頭でとか、ネット上で、SNSでとか等。自分の国に皮肉な名前（天堂、東ラオス、南支那…）をつけつつ、不満ばかりを訴えている若者たち。ですが、この一週間ではまるで、みんなは一つとなり、U23ベトナムチームに向かって全力で応援するようになったような気がします。旧正月よりも、みんなは共有の幸せで楽しんでいる様子となりました。まるで、日常生活での苦労、疲れ、悲しみ全てがよそに、幸せが一つだけ残ったという様子でありました。共通の雰囲気、共通の調和に溶け込んでいたような。 もしかしたらこの時は、１００年に１回だけ起きる奇跡なんだと人民は思います。準々決勝、準決勝でベトナムチームは予想外により強いチームに勝ち抜きました。その奇跡は、ベトナム人民の眠っているサッカーの愛を起こしました。サッカーに全く興味のない人たち、年齢を問わず、みんなは道路に舞い降り、知り合いのない人たちは仲間同士になるように、みんなわいわいしていました。 これは、サッカーを超えるものとなりました。もう愛国心になったと言われていました。奇跡は、みんなを繋げていました。 そして昨日、ベトナム対ウズベキスタン決勝戦にあたり、応援する人たちは大変忙しい１日がありました。みんなはベトナムチームは優勝すると絶対に信じています。ミーディン国歌競技場で熱い応援の火が強く燃え上がっています。奇跡がもう一度起きることを期待しています。本当に、もし優勝したら、全国が爆発することに至るくらいです。 全国は優勝を待っています。ベトナムチームは一位になると思い込んでいます。なのに、今回勝利女神はベトナムチームに向かわなかったのです。１１９分目にウズベキスタンの選手によるゴールは引き分け状態を崩し、ベトナム全国の人民の期待を崩壊させてしまいました。全国、だと言っても言い過ぎではないと思います。残りの１分はやはり逆転を起こすことはきつすぎるでしょう。そのゴールでベトナムチームはウズベキスタンに優勝を譲らざるを得なくなりました。 数年前もし国家チームが負けたらすぐに批難、皮肉を受けるはずでした。しかし、今回は誰も責めない。批判しない。批難もない。「お疲れ様」、「がんばったね」、「よくできたね」…など優しい言葉で慰め合いました。みんなは知っている、ここまでたどり着くために、ベトナムチームは２倍、３倍の自分の力を絞り尽くさなければならないことを。なんと美しいでしょう。 生まれた時からこんなにみんなが結束する景色を見るなんて、やはりこの世はまだ知らないことがたくさんあると認識してしまいました。ただボールが転がるだけじゃない。ただサッカーだけじゃない。すでにサッカー以上のものになった、サッカーを超えるもの、みたいな気がします。みんながボールとともに嬉しくて、寂しくて、この一週間は確かに、ベトナム人にとっては一生味わうことができないことが味わえました。全国同一になったことはきっと、これからもみんなの印象に残り続けるでしょう。 外国人がそういう景色を見ると「ベトナム人サッカーこんなに好きなんだ〜？」と思ってしまいそうでしょうね。それはまあありですけれども、ベトナムチームが決勝戦に入った際はベトナム人民のプライド、民族意識を起こしたからですね。いつになったらまたこういう風に全国一致になるような景色が観れるだろうかなとちょっとしただけ考えてしまいました。サッカーは本当に素晴らしいものです。今更ですが、僕がそういうことを認めます。その景色を体験した人たちはおそらく、同じ意見を思うでしょう。 記事著者：Kaito Yuuki","categories":[{"name":"jinsei-seikatsu","slug":"jinsei-seikatsu","permalink":"https://tsukie.com/categories/jinsei-seikatsu/"}],"tags":[{"name":"zatsudan","slug":"zatsudan","permalink":"https://tsukie.com/tags/zatsudan/"},{"name":"supotsu","slug":"supotsu","permalink":"https://tsukie.com/tags/supotsu/"}]},{"title":"Cài đặt SSL cho website miễn phí, dễ dàng, nhanh chóng với Cloudflare chỉ vài bước click chuột","slug":"cai-dat-ssl-cho-website-mien-phi-de-dang-nhanh-chong-voi-cloudflare-chi-vai-buoc-click-chuot","date":"2018-01-19T07:59:10.000Z","updated":"2018-08-29T14:05:58.793Z","comments":true,"path":"vi/cong-nghe/cai-dat-ssl-cho-website-mien-phi-de-dang-nhanh-chong-voi-cloudflare-chi-vai-buoc-click-chuot/","link":"","permalink":"https://tsukie.com/vi/cong-nghe/cai-dat-ssl-cho-website-mien-phi-de-dang-nhanh-chong-voi-cloudflare-chi-vai-buoc-click-chuot/","excerpt":"","text":"Article available in English | Tiếng Việt Website của bạn có cần SSL ?Hiện nay hầu như các website trên mạng internet, từ blog cá nhân cho đến các website liên quan đến tài khoản ngân hàng, thông tin cá nhân… đều đã cài đặt SSL cho website của mình. SSL là gì và có tác dụng gì? SSL là viết tắt của cụm từ Secure Sockets Layer, cho phép các trình duyệt kết nối đến website của mình thông qua giao thức HTTPS là giao thức có bảo mật mã hóa, đảm bảo các thông tin quan trọng không rơi vào tay hacker hay bất kì bên thứ 3 nào khác cố tình nghe lén (sniffing) thông tin của người dùng. Ở màn hình browser của người dùng, những website có cài đặt SSL (kết nối bằng HTTPS) thì thanh address sẽ hiển thị icon khóa màu xanh. Một tí khái niệm về SSL như vậy, vậy website của bạn có cần SSL không? Nhìn chung cài đặt SSL là trách nhiệm với người dùng, nếu website của bạn chỉ là trang cá nhân, blog… thì có lẽ bạn sẽ thấy chẳng cần nó làm gì, có khi còn tốn thêm tiền mua SSL… cũng đúng. Tuy vậy nó vẫn có vài lợi ích cụ thể với website của bạn. Mình tạm chỉ nêu ra 2 lợi ích của việc cài đặt SSL cho website. Tuy người dùng chẳng quan tâm đến việc SSL làm cái gì, nhưng việc họ nhìn thấy có icon hình cái khóa màu xanh ở thanh address khi vào website của bạn sẽ khiến họ yên tâm hơn khi truy cập. Nói chung người dùng yên tâm rồi thì làm các thứ cũng sẽ dễ dàng hơn. Lợi ích lớn lao hơn: SSL sẽ có ảnh hưởng đến thứ tự SEO của website, dù không lớn lắm. Nếu bạn quan tâm đến SEO cho website của mình thì bất kì cái gì có thể làm tăng rank cho website của bạn trên google search đều đáng thử đúng không? Nếu 2 lí do trên khiến bạn cảm thấy thuyết phục và muốn thử cài đặt SSL, thì hãy đọc tiếp nào! Bạn muốn cài đặt SSL, vậy Cloudflare có gì hay ?Trước kia để cài đặt SSL, bạn phải có chứng chỉ SSL (SSL certificate) được cấp từ các công ty bảo mật lớn như Symantec, VeriSign… các kiểu. Và chúng không rẻ, loại rẻ nhất cũng bay của bạn khoảng vài trăm nghìn 1 tháng. Nhưng bây giờ thì cũng dễ hơn nhiều rồi. Đủ các loại nhà cung cấp với giá thành hạ dần đến mức rẻ gần như các loại hosting domain bán giá của năm đầu tiên. Và còn có cả SSL miễn phí nữa như Let’s encrypt. Nếu SSL chỉ để website của mình khi truy cập có hiện cái khóa màu xanh, và giúp ích cho SEO một tí, thì cứ cái nào rẻ nhất hoặc không tốn tiền thì chọn thôi nhỉ. Tuy nhiên, nếu bạn có chọn dùng SSL miễn phí như Let’s encrypt kia, thì cài đặt nó cũng không dễ gì với đa số mọi người khi phải học cách setup server, chỉnh config, tạo certificate… Chưa kể cách cài đặt còn phụ thuộc vào server của bạn là gì, website của bạn kiểu gì… Nếu cài đặt máy móc không phải là sở trường của bạn, thì mình thấy là công việc này sẽ không vui lắm đâu. Thay vào đó, bạn hãy thử cân nhắc Cloudflare xem. Mọi cài đặt chỉ diễn ra trên browser có kết nối internet của bạn, và thao tác cài đặt chỉ vài bước. Và nó cũng miễn phí, free hoàn toàn! Thêm vào đó, ngoài việc website của bạn được cài đặt SSL, bạn còn có free 1 loạt các tool khác như chặn DDoS, analytic (không được bằng google analytic nhưng cũng tạm)… nói chung nhiều và chắc mình cũng chẳng cần dùng hết. Trong lúc cài đặt, website của bạn sẽ không down tí nào, và nếu không muốn dùng nữa thì chỉ việc gỡ cài đặt ra là xong. Nghe có vẻ ngon nghẻ easy, thử chẳng mất gì lại được lợi, vậy cài thôi nhỉ? Cài đặt SSL với Cloudflare Đầu tiên là tạo 1 account ở https://cloudflare.com. Tạo xong nó sẽ link mình đến trang để nhập link website của mình. Gõ link website vào và bấm scan. Đợi 1 lúc. Đừng sợ khi thấy có nhiều setting làm choáng ngợp. Cứ bấm Continue thôi. Free thôi nghĩ ngợi gì nhiều. Bước cuối cùng: đổi nameserver của domain thành nameserver do Cloudflare chỉ định. Nếu bạn mua tên miền ở Godaddy hay Namecheap, chỉ cần google là thấy ngay làm sao để đổi nameserver của domain của bạn. Mình mua tên miền của 1 hãng nội địa Nhật nên rất tiếc không làm được hướng dẫn phần này (vì có ai khác dùng đâu mà chỉ =)) ). Đừng lo lắng, nếu bạn mua domain từ Godaddy hoặc Namecheap, google mất 10 giây và đổi nameserver mất chưa đến 1 phút, làm đúng như tutorial ở trang tìm kiếm kết quả đầu tiên là được. Đổi xong rồi bấm Continue (bấm trước đổi sau cũng không vấn đề). Chọn Crypto ở thanh công cụ trên cùng và check lại xem SSL status là Full hay Flexible chưa (Cái nào cũng được, Full nghe có vẻ to nên mình dùng Full). Cuối cùng, bấm Purge everything ở mục Caching trên thanh toolbar (Nó cảnh báo giảm performance cứ kệ nó, cá nhân mình chẳng thấy cái gì xảy ra hết). Vậy là xong! Chúc mừng website của bạn đã được cài đặt SSL! Đừng lo lắng nếu bạn chưa thấy hình cái ổ khóa màu xanh khi tự vào website của mình vì thời gian cần thiết để mọi setting chạy là tối đa 72 tiếng. Bài viết bởi Kaito Yuuki","categories":[{"name":"cong-nghe","slug":"cong-nghe","permalink":"https://tsukie.com/categories/cong-nghe/"}],"tags":[{"name":"website","slug":"website","permalink":"https://tsukie.com/tags/website/"},{"name":"hosting","slug":"hosting","permalink":"https://tsukie.com/tags/hosting/"}]},{"title":"Costless, zero-configuration, hassle-free website SSL service by Cloudflare","slug":"costless-zero-configuration-hassle-free-website-ssl-service-by-cloudflare","date":"2018-01-15T05:21:22.000Z","updated":"2018-09-09T02:14:03.587Z","comments":true,"path":"en/technologies/costless-zero-configuration-hassle-free-website-ssl-service-by-cloudflare/","link":"","permalink":"https://tsukie.com/en/technologies/costless-zero-configuration-hassle-free-website-ssl-service-by-cloudflare/","excerpt":"","text":"Article available in English | Tiếng Việt Why bother installing SSL ?Nowadays, a plethora of websites on the internet has been empowered by SSL, from news-serving sites to others dealing with sensitive credentials and critical data. SSL encrypts data sent from users’ browsers to the website server, ensuring that any malicious third-parties can not steal them. Apparently, all service providers working with clients’ sensitive data such as credit card information, are now obligated to implement SSL on their servers. But, if your website is functioning as a personal blog, or like a newspaper, RSS-feed, does not store any of your readers’ personal information, nor dealing with such mentioned above business, you may question why your website should adopt SSL. Regarding this question, it is reasonable that implementing SSL maybe not worth your time and cash invested in it, because implementing SSL only benefits the clients, not the service providers. However, it still has some merits that should be taken into consideration. End users will be shown a green lock and a title saying that the website they are accessing is safe. Though most of them don’t know and will not mind what the heck SSL is doing in the background, the green lock and the notice will reassure them that they will be unlikely to face any troubles caused by security compromise just by visiting your website. According to some internet rumors, having an SSL certificate on your website can affect your ranking on major search engines, especially Google. If you prioritize SEO then being secured by SSL may help you gain a notable advantage against your competitors when it comes to ranking on search engines. If you were persuaded of having your website secured by SSL, then let’s move to the next section! The hassle of traditional SSL and Cloudflare’s solutionCurrently, SSL certificates can be distributed at a much more affordable price than years ago, as most domain providers now also have their own SSL provision. If you don’t choose your domain provider as your SSL provider, there are also a variety of SSL providers worldwide. If you don’t run seriously critical business that handling millions of your clients’ confidential data, then just go with the provider offering the cheapest price since all we need is a tiny green lock displayed on the end user’s browsing address and a better ranking on Google. Yet, even after acquiring an SSL certificate successfully, installing it on the server may seems daunting for beginners and even experts. You may stumble at any steps of CSR creation, bundling certificates, binding to your website, editing host configuration files, etc.. Also, the way to set up an SSL certificate may vary according to the SSL providers and webserver types. That’s when Cloudflare service comes to rescue! Cloudflare service offers zero-configuration, browser-based setup procedure for implementing SSL, and on top of that, it is FREE! For bloggers, writers, pennies per month just to maintain a tiny green lock on users’ browsers is overpriced, therefore a free option is obviously better! After registering with Cloudflare, you are not only provided with free SSL certificate, but also tons of helpful services like analytics, DDoS protection, cache management… and they are free too! Of course they also offer premium plans if you are willing to pay for more advanced services, but in this article we will stick with the free plan since it fully covers our needs here - a working SSL certificate. I will not go into details of why Cloudflare can offer SSL certificates for free, please find it in other articles. Procedure to have your website secured by Cloudflare First, register an account at https://cloudflare.com. After registering, you will be taken to a screen that requires you to enter your website domain. From here, type your website domain in the address bar and hit Scan. While the server is gathering required information you will be welcomed with a video showing how Cloudflare SSL works. After a while, you will be taken to the next screen, where your website’s DNS records are shown. Typically, if your site is already up and currently running, just ignore these settings and hit Continue. The next screen is a table of offered service plans. Choose Free website and continue, you can always upgrade to a higher tier plan later. This is the last step of registering your domain to Cloudflare service. Change your domain’s nameservers to the listed nameservers respectively. How you can change nameservers depends on where you purchased your domain, however if you purchased yours from a well-known supplier like GoDaddy or Namecheap, just google “how to change nameservers” plus your supplier’s brand name and a thoroughly written instruction will be found at search result page 1. Press Continue when you finished changing your nameservers. From now on you will be working with the dashboard. Select Crypto from the toolbar menu and verify that SSL status is set to Full or Flexible (I am using Full though). Finally, hit Purge everything in the Caching preference, and congratulation! Your domain is secured by Cloudflare’s SSL successfully! Please note that from the moment the setup is finished to the time https is displayed on end-users’ devices it may take up to 72 hours to reflect all settings so don’t worry if you haven’t seen your green lock on browser address bar yet. ConclusionOf course, if your server needs a specialized mechanism to encrypt data, or your service works with cash, credit information, or personal data, then you may prefer your SSL be issued by popular security firms like Symantec, Comodo, Verisign… and have your SSL installed by specialists. But, if your website only serves static contents, or blogs, resumes… why don’t give Cloudflare a chance? It will make your site look cooler, and it just takes minutes to complete. P/s: The idea of free SSL was carried by Kloudsec before, and sadly it was gone bankrupt. Let’s Encrypt is also a free SSL distribution, but Certbot and other deployment tools might have a steep learning curve. Let’s choose something that suits our needs best, and worth our investment. Article written by Kaito Yuuki","categories":[{"name":"technologies","slug":"technologies","permalink":"https://tsukie.com/categories/technologies/"}],"tags":[{"name":"website","slug":"website","permalink":"https://tsukie.com/tags/website/"},{"name":"hosting","slug":"hosting","permalink":"https://tsukie.com/tags/hosting/"}]},{"title":"椅子物語","slug":"isu-monogatari","date":"2018-01-14T05:18:19.000Z","updated":"2018-08-29T14:05:58.810Z","comments":true,"path":"ja/jinsei-seikatsu/isu-monogatari/","link":"","permalink":"https://tsukie.com/ja/jinsei-seikatsu/isu-monogatari/","excerpt":"","text":"Article available in English | Tiếng Việt | 日本語 みんなさんは多分、いつからもう他人を簡単に信じれないようになったのかって、いつから自分を守る壁を立って世界にそれを向かわせるようになったのかって、自分に質問したことがあるでしょうね。 大人になったら、世界は甘くないことに気づくようになるのは当然でしょう。何も企まずにただ純粋に触れ合う大人たちは多分いないだろうと思われます。が、必ずしも世界は残酷なことばかりじゃないのではないかと、ネット上で偶然に見かけた以下の短いコミックでそういうことを伝えたいのです。 何故ならば、残酷なことがありつつも、美しいことをたくさん抱いているのでしょう、この世界は。 （コミックを読むときに左から呼んでくださいね。） 記事著者：Kaito YuukiイラストはprojectTIGER devianartから","categories":[{"name":"jinsei-seikatsu","slug":"jinsei-seikatsu","permalink":"https://tsukie.com/categories/jinsei-seikatsu/"}],"tags":[{"name":"zatsudan","slug":"zatsudan","permalink":"https://tsukie.com/tags/zatsudan/"}]},{"title":"\"Reflections on trusting trust\"","slug":"reflections-on-trusting-trust","date":"2018-01-08T06:26:30.000Z","updated":"2018-09-09T02:48:31.975Z","comments":true,"path":"en/technologies/reflections-on-trusting-trust/","link":"","permalink":"https://tsukie.com/en/technologies/reflections-on-trusting-trust/","excerpt":"","text":"Article available in English I came across this topic “Thompson, Kenneth Lane – Reflections on trusting trust” (pdf link: http://vxer.org/lib/pdf/Reflections%20on%20Trusting%20Trust.pdf ) on an answer while I was reading quora. I can’t find that answer now, but the writer was talking about how he was having a hard time fixing a bunch of “out of nowhere” bugs on the deadline of his assignment, and then realized later that those were not his bugs – the problem was caused by the new version of the third-party software he was using. His answer enlightened me in many ways. The article he mentioned was a really old one – which was written in 1983, but its main point will still be valid for a long time I think, and will always be one of the “must read” for a junior developer like me right now. The problem rose from just upgrading Windows…When Microsoft released Windows 10 Creator update, all of the computers in my office were informed to update Windows. No one experienced any problem, except for the reverse proxy server. It used “Bridge Adapter”, and not only us who were suffering from the issue with it, but lots of people on the VirtualBox forum got it too, so much that in some topics later the moderator didn’t even bother to reply anymore. (I even read one topic where the moderator expressed his anger for Windows and how dumb it is to cause these problems). Because this server is critical, my supervisor was suffering for the whole week from fixing it, but nothing worked. Pack it to a “hasn’t updated” PC, everything worked well. We even tried reversing the Windows version, but still not work. At last, to save time and our nearly depleted sanity, we decided to leave the server to stay still in a “hasn’t updated” PC, and never attempted to update it again. Perhaps we may try again in the future, when the compatibility of Windows and Virtual Box got better, or who knows, maybe we will switch to Windows’s built-in VM one day if in the end Microsoft’s VM won the battle. …to other softwareThis is just one of many problems I experienced with third-party software since I started working. Usually, they are just small problems, but these problems always remind me of Ken’s article, and make me feel the urge to learn more and more, to understand “how much should I trust”. To be able to trust, we ought to understand things clearly first. The problem can become greater if that’s a tool which can change your code – Tortoise Git for example. There was more than one time when I was resolving conflicts while applying stash, and even after I chose the chunks of code I wanted to keep, they still appeared as conflicted again. When I went into the code to resolve the conflicts manually, I realized it did apply the change to the code, but somehow the UI display was not right – so when I repeated the process, I applied it three times. It’s not that hard to understand how things work – I never heard about Process Monitor before until the day our reverse proxy server broke, and using it was a fantastic experience. It’s not Microsoft’s fault to broke our server, it’s our fault for not understand it well enough. And that made me understand why software’s changelogs are essential. Usually, when trying a new version, I only care about its new features, all the others “technical logs” were put aside. However, in a working environment, where reading logs is one of the most important things to do (debug logs, error logs), reading third-party software’s changelogs is also no less critical. You can’t just update immediately without thinking – don’t trust it immediately. Usually, they should be fine, but maybe on one of the most important days of your career life, it’ll screw you up. Shinichi Akiyama in Liar Game once said, you need to doubt everything. No doubt is just giving up on trying to understand clearly, it’s plain apathy. Question them. Suspect them. When you got your answer on how much you should trust something, you’ll do everything better, and resolve it better when problems happen. Programming languages are no different eitherAlso, this goes the same for Programming Language. It won’t be enough to just “know” a language – to understand how a language works is the real meaning of “learning”. Or else, when your code doesn’t work as expected, the only thing you can do is lamenting “why the f** %$@&amp;!”. I’ll come back one day with another article about this problem, when I have interesting ideas to write about, or only with the problem in Ken’s article “Write a self-reproducing program”. I really envy people who have wise knowledge on the language they’re using. This one is an example about PHP that our supervisor gave us on our training: https://eev.ee/blog/2012/04/09/php-a-fractal-of-bad-design/ that belonged to an awesome blog that you really should check it out! When I worked with PHP, there were many times I was annoyed by it, but I never noticed these details because I didn’t doubt it enough. I didn’t know which language PHP was written by, which compiler PHP is using, and I didn’t notice “how” PHP works carefully. That’s why my level of understanding is not improved. To reach a high level of understanding it will require serious effort to be put into studying and working. And with PHP 7 came out, knowledge will need to be updated frequently, too. ConclusionTo end this article, I’ll talk about CSS. Many people say HTML is not a programming language, and look down on CSS. In my opinion, CSS is really convenient: it’ll save you loading space, and can do many things that you thought only JS or an image could do. And it’s not easy – if we didn’t know precisely what a CSS line actually do. From simple properties like padding, to tricky one like z-index, CSS doesn’t tell us exactly what it does. Nowadays it’s effortless to have a modern-looking website with awesome CSS libraries, so you may think it’s not necessary to put so much time in CSS. However, real life is not a paradise, if you end up working with front-end someday, a simple div may become the root of your hard time. Many time I believed that I did something, but CSS actually did something different that resulted in wrong positioning. The lesson I learned was “Don’t let yourself be deceived by language”. To trust things right, you need to trust yourself on what you do, too, and to be able to trust yourself right, it’s all up to you. Article written by Fuuka Adachi","categories":[{"name":"technologies","slug":"technologies","permalink":"https://tsukie.com/categories/technologies/"}],"tags":[{"name":"software-development","slug":"software-development","permalink":"https://tsukie.com/tags/software-development/"},{"name":"experience","slug":"experience","permalink":"https://tsukie.com/tags/experience/"}]},{"title":"Cái ghế","slug":"cai-ghe","date":"2018-01-07T16:03:30.000Z","updated":"2018-01-13T16:06:30.000Z","comments":true,"path":"vi/cuoc-song/cai-ghe/","link":"","permalink":"https://tsukie.com/vi/cuoc-song/cai-ghe/","excerpt":"","text":"Article available in English | Tiếng Việt | 日本語 Có bao giờ ta tự hỏi mình rằng, từ lúc nào thì ta trở nên không còn dễ dàng tin vào người khác nữa. Từ lúc nào ta tự khép mình vào vỏ bọc để ngăn cản những tác động của cuộc đời làm tổn thương đến ta nữa. Khi lớn lên, con người nhận ra rằng thế giới không hề đơn giản. Mọi người không tiếp xúc với nhau mà không hề toan tính một điều gì cả. Trong mẩu truyện ngắn tình cờ lướt qua ở trên mạng dưới đây, ta có thể nhìn thấy một phần hình ảnh của mình trong nhân vật của truyện. Hi vọng rằng, nó sẽ giúp suy nghĩ trong mỗi người chúng ta bớt tàn nhẫn hơn với cuộc đời. Bởi vì, dù sao cuộc đời vẫn còn rất nhiều điều tốt đẹp để hi vọng. Bài viết bởi Kaito YuukiTruyện tranh từ projectTIGER devianart","categories":[{"name":"cuoc-song","slug":"cuoc-song","permalink":"https://tsukie.com/categories/cuoc-song/"}],"tags":[{"name":"tan-man","slug":"tan-man","permalink":"https://tsukie.com/tags/tan-man/"}]},{"title":"The chair","slug":"the-chair","date":"2018-01-07T14:56:30.000Z","updated":"2018-01-13T16:06:30.000Z","comments":true,"path":"en/lifestyle/the-chair/","link":"","permalink":"https://tsukie.com/en/lifestyle/the-chair/","excerpt":"","text":"Article available in English | Tiếng Việt | 日本語 Have we ever questioned ourselves that since when we gradually became more and more cautious, paranoid to others’ behaviors without even noticing it? Since when we hardened our shields and made them face the life, to protect our fragile hearts from the tide of the life. While surfing on the Internet, this short comic below caught my glimpse. Maybe everyone can see a part of ourselves in this short comic. Hopefully, the story can somehow cure a part of thorns of doubt in us. Because, while bathed in unjustness, the world is still embracing many beautiful moments, waiting to be unveiled. Article written by Kaito YuukiImages from projectTIGER devianart","categories":[{"name":"lifestyle","slug":"lifestyle","permalink":"https://tsukie.com/categories/lifestyle/"}],"tags":[{"name":"trivia","slug":"trivia","permalink":"https://tsukie.com/tags/trivia/"}]}]}